{
  "1": {
    "title": "",
    "sections": [
      {
        "type": "p",
        "content": "Title suggestions;"
      },
      {
        "type": "p",
        "content": "A Saiqo ebook for newbies and mid-level SEO writers."
      },
      {
        "type": "p",
        "content": "A SAIQO ebook for newbies and mid-level SEO writers."
      },
      {
        "type": "p",
        "content": "An ebook for newbies & mid-level SEO writers."
      },
      {
        "type": "p",
        "content": "Write better for your clients and earn legit (& more) money."
      },
      {
        "type": "p",
        "content": "Saiqo SEO Blog Writing eBook"
      },
      {
        "type": "p",
        "content": "For newbies and mid-level SEO writers"
      },
      {
        "type": "p",
        "content": "Write better for your clients and earn legit (& more) money."
      },
      {
        "type": "p",
        "content": "Unit 0:"
      }
    ]
  },
  "2": {
    "title": "Who am I to write this guide?",
    "sections": [
      {
        "type": "h1",
        "content": "Who am I to write this guide?"
      },
      {
        "type": "p",
        "content": "I am Saiqo :)"
      },
      {
        "type": "p",
        "content": "I started my SEO content writing journey in the middle of 2021 (yes, wayyy before GPT), and in the past 4 years, I have (ghost)written over 340 blogs and articles for over 55 clients in 15+ industries. In the mid of 2022, I got a Level Two Seller badge on Fiverr and then in early  2023, my Fiverr got banned. And I shifted to LinkedIn. I started on Upwork in January 2024…, and in March 2024, I got the top-rated badge."
      },
      {
        "type": "p",
        "content": "I have earned $20k+ in the past two years solely from SEO blog posts. Those blog posts helped me feed my family of 7, travel almost 65% of Pakistan, and my new home is just being constructed."
      },
      {
        "type": "p",
        "content": "Now I have a non-typical DFY blog writing agency, and we manage our client's blog from scratch."
      },
      {
        "type": "p",
        "content": "Sounds like I’m writing a resume:)"
      },
      {
        "type": "p",
        "content": "But anyways….I know a thing or two about SEO blog writing, and you will learn everything I know."
      },
      {
        "type": "p",
        "content": "Fair enough?"
      },
      {
        "type": "p",
        "content": "Ok, but what’s this SAIQO thing?"
      },
      {
        "type": "p",
        "content": "Saiqo is an acronym. It stands for;"
      },
      {
        "type": "p",
        "content": "S = Search Intent."
      },
      {
        "type": "p",
        "content": "A = Auntnticity."
      },
      {
        "type": "p",
        "content": "I = Insightful."
      },
      {
        "type": "p",
        "content": "Q = Quality."
      },
      {
        "type": "p",
        "content": "O = Original"
      },
      {
        "type": "p",
        "content": "These are ‘elements’ that make a blog post ‘rank-worthy’ and ‘read-worthy.’"
      },
      {
        "type": "p",
        "content": "Why am I writing this guide when you can literally find 1000s of SEO content writing guides on Google and tutorials on YouTube?"
      },
      {
        "type": "p",
        "content": "There were times when I was a total nut…and used to get excessively nervous when clients approached me for a project."
      },
      {
        "type": "p",
        "content": "What to chat with the client…how to start the project…what if I can't complete the project…what if the client gets angry with me…what if they curse me….were some of my first thoughts…"
      },
      {
        "type": "p",
        "content": "At that time, I did not find any guide to show me the process…the roadmap needed to complete a client’s blog post project. Some guides get too deep into research and ignore other factors. Some touch on all the aspects (On-page SEO, structure, etc.) but miss other details, like how to research and outline stuff. I really wish I knew everything that I know today. But today, when I know… I want to transfer everything, in the hope that it will save you time…loads of time and stress."
      },
      {
        "type": "h2",
        "content": "What you should expect from this guide?"
      },
      {
        "type": "p",
        "content": "There are two things in SEO blog writing…"
      },
      {
        "type": "p",
        "content": "After reading this guide, you won’t become an “EXPERT” SEO blog writer."
      },
      {
        "type": "p",
        "content": "Writing needs practice. Expertise comes with grinding and writing daily. You also need discipline, a constant reading habit, a curious mind, and an itch to serve the reader with THE best."
      },
      {
        "type": "p",
        "content": "No one can spoon-feed you “good writing.” And there is no ‘good writing’ as ‘good’ is always subjective. That is your part to excel."
      },
      {
        "type": "p",
        "content": "This guide will show you a roadmap, a method…, and a way to write blogs the right way. You won’t need to take any other courses…or spend countless days and nights just navigating the process…as I once struggled to do."
      },
      {
        "type": "p",
        "content": "This guide is about the process from scratch to end with important concepts you must know. In other words, I can safely say that this guide has all the ingredients you need to cook a perfect blog….but as you know, every cook cooks differently (and as per their cheffing talent) even given the same ingredients…so is the case with this guide…."
      },
      {
        "type": "p",
        "content": "The better you can write…the better this guide will serve."
      },
      {
        "type": "p",
        "content": "Unit 1:"
      }
    ]
  },
  "3": {
    "title": "Some Basics Before You Get into Writing",
    "sections": [
      {
        "type": "h1",
        "content": "Some Basics Before You Get into Writing"
      },
      {
        "type": "p",
        "content": "First thing First…"
      },
      {
        "type": "h2",
        "content": "Who Needs SEO Blog Posts and What’s Their Purpose?"
      },
      {
        "type": "p",
        "content": "If you already know this, you can simply skip it and let me talk to the ones who are just getting started."
      },
      {
        "type": "p",
        "content": "Who needs blog posts?"
      },
      {
        "type": "p",
        "content": "Widely speaking, anyone who has a website on Google need blog posts. We call them “website owners.”"
      },
      {
        "type": "p",
        "content": "And those website owners fall into 5 major categories (I have categorized them in ‘most demanded’ to ‘least demanded’ order);"
      },
      {
        "type": "h3",
        "content": "Product Providers"
      },
      {
        "type": "p",
        "content": "Think about ANY type and kind of business that sells tangible (physical) products. They might operate through e-commerce platforms like Amazon, Shopify, or eBay or have their website on a CMS (Content Management System) like WordPress, Content Hub, or Magento. In some cases, they might even have both—an e-commerce store and a separate website on a CMS."
      },
      {
        "type": "p",
        "content": "So, anyway…you get the idea; any business owner selling physical products needs a blog post writer."
      },
      {
        "type": "h3",
        "content": "Software as Service Providers (or SaaS Founders)"
      },
      {
        "type": "p",
        "content": "They have products but not physical ones. Think about tools (like AI writing tools, video editing, image editing, or any AI tool), extensions (like chrome or web extensions), and software (like Microsoft, Jira, etc.)."
      },
      {
        "type": "p",
        "content": "There have been boatloads of AI tools in the market since the AI boom. And now there is a tool for almost any task….so yes, SaaS founders need SEO blog writers."
      },
      {
        "type": "h3",
        "content": "Digital Service Providers"
      },
      {
        "type": "p",
        "content": "Think about ANY person who has a digital service to offer falls under this category. Freelancers, digital marketing agency owners, marketers, coaches, consultants, therapists, psychologists, trainers, and teachers…. all have digital services to offer, and they all need a blog post writer to write content."
      },
      {
        "type": "h3",
        "content": "Niche Content Creators"
      },
      {
        "type": "p",
        "content": "These are the folks who don’t have any service or product business. They create a website on a specific niche like lifestyle, travel, or food and create content around it. Their business is to get revenue via Google AdSense or affiliate marketing. They need a blog post writer to write content around their niche."
      },
      {
        "type": "h3",
        "content": "Nonprofits and Educational Institutes"
      },
      {
        "type": "p",
        "content": "Nonprofit organizations (NGOs, churches, charities, etc.) need SEO blog writers. Similarly, educational institutes (Govt & public schools & colleges, vocational training institutes, academies, etc.) also need SEO blog writers."
      },
      {
        "type": "p",
        "content": "====="
      },
      {
        "type": "p",
        "content": "My purpose is to give you a broad perspective on whom you can write SEO blog posts for."
      },
      {
        "type": "p",
        "content": "If you have not written any blog post before, just sit with yourself and think from these 5 categories…who would you like to write for?"
      },
      {
        "type": "p",
        "content": "It will help you a lot, I promise."
      },
      {
        "type": "p",
        "content": "NOTE: I didn’t explicitly use the category “business owners.” Because, somehow, everyone owning a website has some kind of business to do or offer. We all are business owners."
      },
      {
        "type": "p",
        "content": "Now…."
      },
      {
        "type": "p",
        "content": "What’s the purpose of a blog post?"
      },
      {
        "type": "p",
        "content": "Mainly two;"
      },
      {
        "type": "h3",
        "content": "Get organic traffic (number of visitors or users)."
      },
      {
        "type": "p",
        "content": "Nothing on the planet earth is better than blog posts to get ORGANIC, long-term, sustainable traffic on your website. I can bet my last penny for this…and win. Everyone knows it. Blog posts bring visitors, and those visitors convert into customers or clients."
      },
      {
        "type": "h3",
        "content": "Build Authority"
      },
      {
        "type": "p",
        "content": "Ok, this is somehow ambiguous. What kind of authority? A business owner with a physical product, service, or software must write about it. That’s the only way to “educate” their target audience/customers. And that’s the only way to “differentiate” your offer/service/product from your competitors. And that’s the only way to describe their problems and offer solutions. And that’s the only way to inform them about the problems they might face soon."
      },
      {
        "type": "p",
        "content": "So when a website owner educates/informs their readers and differentiates themselves from their competitors…it builds authority…and authority builds trust."
      },
      {
        "type": "p",
        "content": "Now you might be having a question…"
      },
      {
        "type": "p",
        "content": "“Do people still read blog posts?”"
      },
      {
        "type": "p",
        "content": "Yes, they do. And I suggest you Google this question. You will get stats and logic and all the reasons why in 2024, 83% of internet users read blog posts."
      },
      {
        "type": "p",
        "content": "That’s your first homework."
      },
      {
        "type": "p",
        "content": "Come up with at least 5 reasons & logics why people read blog posts."
      },
      {
        "type": "h2",
        "content": "What can you, as an SEO writer, promise your client?"
      },
      {
        "type": "p",
        "content": "Sure….blog posts do a lot for a website owner. But you, as an SEO blog writer, can’t guarantee rankings (trrafic), sales or revenue."
      },
      {
        "type": "p",
        "content": "Why?"
      },
      {
        "type": "p",
        "content": "Because written content is just one piece of the puzzle."
      },
      {
        "type": "p",
        "content": "Here are all of the things that are involved in getting rankings;"
      },
      {
        "type": "p",
        "content": "So, you see……SEO content writer comes in the middle of this process. If keyword research is not done correctly, or if the content strategy is not strong enough…the blog you write for your client will not get rankings easily. After you write a blog, your client uploads it on their website…if they don’t upload it properly, it will affect rankings. After uploading the blog post, your client needs to take care of off-page and technical SEO."
      },
      {
        "type": "p",
        "content": "So, no one can guarantee rankings if any of this is weak. AND there is no guarantee for rankings whatsoever. There are some 200+ KNOWN factors that Google takes into account…and there are MANY unknown factors, too."
      },
      {
        "type": "p",
        "content": "So what does this all mean? What should you promise to your clients? Because the whole purpose of a blog is to increase organic traffic…."
      },
      {
        "type": "p",
        "content": "Here is what I promise to my clients…"
      },
      {
        "type": "p",
        "content": "That is pretty much all I can promise. I promise my client that the content I write will be 2x better as the existing one. It will be unique and fulfill the purpose and their requirements."
      },
      {
        "type": "p",
        "content": "Now let’s see what kind of clients you usually have to deal with."
      },
      {
        "type": "h2",
        "content": "Know Your Client"
      },
      {
        "type": "p",
        "content": "Let me set the scenario for you…"
      },
      {
        "type": "p",
        "content": "You're an SEO blog writer working for a client. The negotiation phase is over, and you've successfully closed the deal. By now, you have a sense of where your client falls on the spectrum."
      },
      {
        "type": "p",
        "content": "Most clients will fall somewhere in between these two extremes."
      },
      {
        "type": "p",
        "content": "These clients provide you with everything: keywords, a complete topic with outlines, target audience details, the blog's purpose, word count, graphics, and every other detail. If you're just starting, these clients are a blessing. They guide you through the process, telling you exactly what to include and avoid."
      },
      {
        "type": "p",
        "content": "Typically, these clients come from content writing agencies, marketing agencies, or senior freelancers looking to outsource some of their work."
      },
      {
        "type": "p",
        "content": "Note: Some clients in this category can be a bit of a challenge. They often think they know everything about the job market trends, writing, and its process. This can lead to them devaluing your rates and trying to micromanage you. My best advice is to avoid them initially, but as you gain experience, you'll learn how to handle them effectively."
      },
      {
        "type": "p",
        "content": "These clients only know one thing: \"Our website needs 'written content' to drive more traffic, so we need to hire an SEO writer.\" That's it. They often have a new website, no content strategy, and little understanding of the process. They're typically impatient for results, and about 80% will stop publishing SEO content just after two or three months."
      },
      {
        "type": "p",
        "content": "You'll mostly find these clients on LinkedIn or other social media platforms. You can work with them if you know how to educate and convince them and if you have some knowledge of SEO and content strategy (which most mid-level SEO writers do)."
      },
      {
        "type": "p",
        "content": "Then there’s a middle category—clients who don't pretend to know everything but aren't new to the industry. They understand what an SEO writer can do and what they need to provide. They communicate clearly and have fair expectations."
      },
      {
        "type": "p",
        "content": "Working with the all-knowing is easy while dealing with the new ones can be a bit harder."
      },
      {
        "type": "p",
        "content": "It's important to understand and assess the type of client you're dealing with. That’s why you often hear and read sentences like “Know your ideal customers” and “Understand your ICP (ideal client personas).” When you know your client, you write better and overdeliver."
      },
      {
        "type": "p",
        "content": "So, take the time to get to know your client and understand where you stand. That's your first step."
      },
      {
        "type": "p",
        "content": "In any case…"
      },
      {
        "type": "p",
        "content": "All clear until now?"
      },
      {
        "type": "p",
        "content": "But we need to clarify 1 more basic concept to help you in your overall SEO blog writing journey."
      },
      {
        "type": "h2",
        "content": "Know What You Are Writing"
      },
      {
        "type": "p",
        "content": "You know YOU, your client, and what you have signed up for….here is one more thing you need to know before even thinking of writing anything for your client."
      },
      {
        "type": "p",
        "content": "It’s…what format and type of blog you will write."
      },
      {
        "type": "h3",
        "content": "Formats of Blog Posts"
      },
      {
        "type": "p",
        "content": "The format is the “structure” or “style” in which the content is presented. Different formats serve different purposes and appeal to different audiences. (Don’t confuse it with the ‘inner’ formatting of an individual blog post. I have discussed it in unit 4 as well)."
      },
      {
        "type": "p",
        "content": "There are more than 15 formats of blog posts. But we will focus on major 7."
      },
      {
        "type": "p",
        "content": "(For the love of writing…don’t skip this part:)"
      },
      {
        "type": "h4",
        "content": "Listicles"
      },
      {
        "type": "p",
        "content": "This format typically features a numbered list. This type is popular nowadays because it is easy to read and skimmable."
      },
      {
        "type": "p",
        "content": "Listicles often include tips, strategies, or recommendations."
      },
      {
        "type": "p",
        "content": "Examples;"
      },
      {
        "type": "h4",
        "content": "How-to Posts/Guides (also sometimes referred to as long-form posts)"
      },
      {
        "type": "p",
        "content": "This format provides step-by-step instructions on how to accomplish a specific task or achieve a particular goal. How-to guides are usually detailed, ‘practical,’ and informative."
      },
      {
        "type": "p",
        "content": "Examples;"
      },
      {
        "type": "h4",
        "content": "‘What’ and ‘Why’ Posts."
      },
      {
        "type": "p",
        "content": "Also known as “explanatory” posts. Their intent is purely “educational”. The “what” format explains a “concept.” The “why” format explains why a “concept” is important."
      },
      {
        "type": "p",
        "content": "Example;"
      },
      {
        "type": "p",
        "content": "What is Blog writing? (‘What’ format)."
      },
      {
        "type": "p",
        "content": "Why is Blog Writing Important? (‘Why’ format)."
      },
      {
        "type": "h4",
        "content": "Curated Posts"
      },
      {
        "type": "p",
        "content": "As the name suggests, you ‘curate’ content by researching a specific topic extensively. You will gather statistics and relevant information from credible sources and write in an easy-to-consume way."
      },
      {
        "type": "p",
        "content": "Examples;"
      },
      {
        "type": "p",
        "content": "You got the idea?"
      },
      {
        "type": "h4",
        "content": "Thought-leader or Opinionated Posts"
      },
      {
        "type": "p",
        "content": "This format is used when writers (in our case, your client…and they hire an expert…YOU) share their ‘expert’ viewpoint or opinion on a specific topic. Thought-leadership post style usually points out things like where the industry is heading…or what will be the results of recent updates in a particular industry."
      },
      {
        "type": "p",
        "content": "Examples;"
      },
      {
        "type": "h4",
        "content": "Case Studies"
      },
      {
        "type": "p",
        "content": "Case studies are in-depth analyses of real-life situations, projects, or experiences. They often include background information, challenges faced, solutions implemented, and results achieved."
      },
      {
        "type": "p",
        "content": "Mostly, this format is used to show expertise."
      },
      {
        "type": "p",
        "content": "Examples:"
      },
      {
        "type": "h4",
        "content": "Comparisons"
      },
      {
        "type": "p",
        "content": "You simply compare two (or more) things (products, platforms, services) here."
      },
      {
        "type": "p",
        "content": "And oftentimes, you share your take/viewpoint/experience for each thing…"
      },
      {
        "type": "p",
        "content": "Example:"
      },
      {
        "type": "p",
        "content": "I shared these formats because they help in determining the tone and style of a blog post. But, no need to stress about memorizing every type and format."
      },
      {
        "type": "p",
        "content": "Some are obvious and can be identified just by looking at your client's title or topic. Other times, when you're given a primary or short-tail keyword, you'll conduct a SERP analysis (discussed in detail below) to decide on the format"
      },
      {
        "type": "p",
        "content": "Ok, just 1 more thing…"
      },
      {
        "type": "h2",
        "content": "Types of Blogs SEO Writers Usually Deal With…"
      },
      {
        "type": "p",
        "content": "In 90% of the cases, you will write for two types of blogs..."
      },
      {
        "type": "h3",
        "content": "1. Money-Making Blogs"
      },
      {
        "type": "p",
        "content": "These blogs exist primarily to generate income, often through various monetization strategies such as Google AdSense, affiliate marketing, or brand partnerships. Your client doesn’t offer a product or service directly but focuses on driving traffic to their blog to earn revenue."
      },
      {
        "type": "h4",
        "content": "Types of Money-Making Blogs:"
      },
      {
        "type": "p",
        "content": "Affiliate Blogs: These blogs earn through affiliate commissions by promoting products or services other companies offer. They often publish product reviews, top product lists, or how-to guides that link to affiliate products."
      },
      {
        "type": "p",
        "content": "For example, blogs about electronics, beauty products, health supplements, or home appliances often rely on affiliate income. Each time a reader clicks through and makes a purchase, the blog owner earns a commission."
      },
      {
        "type": "p",
        "content": "Ad-Supported Blogs: These websites rely heavily on ad revenue, often through platforms like Google AdSense. Ad-supported blogs usually cover topics with mass appeal to attract high traffic volumes, such as entertainment, news, and lifestyle, or general interest topics like food, fashion, and DIY. The goal is to generate as many page views as possible to maximize ad impressions."
      },
      {
        "type": "p",
        "content": "Niche Content Blogs: Some blogs focus on a very specific niche—like personal finance, travel, or pet care—and earn through partnerships or sponsored content. These blogs often establish authority in a specific field and collaborate with brands to promote products or services, earning income from the brand partnerships."
      },
      {
        "type": "p",
        "content": "As an SEO writer for these blogs, your primary focus will be writing content that attracts high traffic, engages readers, and ranks well on search engines to drive monetization."
      },
      {
        "type": "h3",
        "content": "2. Business Blogs"
      },
      {
        "type": "p",
        "content": "Business blogs are tied directly to a company’s products or services. Their main goal is not direct income from the blog itself but rather to drive awareness, attract potential customers, and educate readers in a way that supports the business's offerings. This type of blog is critical for content marketing strategies, and your writing should help showcase the company’s expertise, answer customer questions, or demonstrate product benefits."
      },
      {
        "type": "h4",
        "content": "Types of Business Blogs:"
      },
      {
        "type": "p",
        "content": "Service-Based Blogs: Businesses offering services—such as marketing agencies, financial consulting firms, legal services, or IT support—use blogs to attract clients by educating them on relevant topics."
      },
      {
        "type": "p",
        "content": "For instance, a digital marketing agency might publish blog posts about SEO strategies, social media marketing tips, or case studies that illustrate how their services have helped clients succeed."
      },
      {
        "type": "p",
        "content": "E-Commerce Blogs: E-commerce businesses often use blogs to promote their products and build brand awareness. These blogs typically include product-related content such as buying guides, product comparisons, seasonal gift ideas, and how-to articles."
      },
      {
        "type": "p",
        "content": "For example, an online store selling fitness equipment might publish blogs about workout routines, fitness trends, or guides on selecting the right equipment."
      },
      {
        "type": "p",
        "content": "SaaS (Software as a Service) Blogs:"
      },
      {
        "type": "p",
        "content": "Companies offering digital products or software tools—like project management software, CRM platforms, or cloud storage solutions—use their blogs to educate potential customers about their tools and how they solve common problems. SaaS blogs often feature tutorials, industry news, or expert tips on maximizing the value of their software."
      },
      {
        "type": "p",
        "content": "B2B (Business-to-Business) Blogs: These blogs target other businesses, and the content focuses on more technical or industry-specific topics. B2B companies use blogs to educate potential customers on complex services or products, such as manufacturing equipment, logistics software, or corporate training programs."
      },
      {
        "type": "p",
        "content": "Why am I telling you all this?"
      },
      {
        "type": "p",
        "content": "It is essential to understand which type of writing you will write–It will help you determine the overall tone/style of the writing and the purpose of your client. Business blogs often have a formal, professional, and ‘expert’ tone. Personal blogs usually have an informal and conversational tone.  Money-making blogs could have a mixture of both, depending on the topic."
      },
      {
        "type": "p",
        "content": "When you know the ‘type’, you do better research. For instance, you look for stats, reports, research, and official case studies for business blogs. For personal blogs, you search for people’s opinions, viewpoints, and experiences on social media like YT, FB, Insta, or sites like Quora or Reddit, or maybe online reviews on review sites."
      },
      {
        "type": "h2",
        "content": "Homework for Newbies"
      },
      {
        "type": "p",
        "content": "Tip: Go to Google News. Read the headlines. Try to decide which format is the best for your selected headline."
      },
      {
        "type": "p",
        "content": "Unit 2:"
      }
    ]
  },
  "4": {
    "title": "Important Concepts",
    "sections": [
      {
        "type": "h1",
        "content": "Important Concepts"
      },
      {
        "type": "p",
        "content": "Everything you need to ace your SEO content writing game"
      },
      {
        "type": "h2",
        "content": "1): On-Page SEO Elements (what you should consider as an SEO writer)"
      },
      {
        "type": "p",
        "content": "SEO has three main categories:"
      },
      {
        "type": "p",
        "content": "As an SEO writer, you are primarily concerned with on-page SEO elements. On-page SEO refers to all the functions and operations you can perform on a web page, which contains content ( text, visuals, videos, etc. )."
      },
      {
        "type": "p",
        "content": "List of on-page SEO elements that you, as a writer, can take care of:"
      },
      {
        "type": "h3",
        "content": "Meta Tags"
      },
      {
        "type": "p",
        "content": "Meta tags for a blog include the SEO title and meta description."
      },
      {
        "type": "p",
        "content": "It should include the primary/seed keyword and be catchy, concise, and clear. The ideal length is between 50 to 70 characters (8 to 12 words)."
      },
      {
        "type": "p",
        "content": "You can add secondary keywords in the title, but only if it sounds natural. Ensure the title reads like a complete sentence, not just a phrase or separate words."
      },
      {
        "type": "p",
        "content": "According to Google Search Central Blog (and SEMrush), Google does not use keywords in meta descriptions for web ranking. The purpose of the meta-description is to tell the reader whether the content of the page is relevant to their search query. If the meta description tells the reader they get what they are searching for, they will click and read the post."
      },
      {
        "type": "p",
        "content": "What can you do to optimize the meta description?"
      },
      {
        "type": "p",
        "content": "Simple, clear, and no-fluff MDs are always the best. I write the meta description of the blog post at the end. This way, I am more familiar with the topic and know the most STRONG points to convince readers to read the blog."
      },
      {
        "type": "h3",
        "content": "ALT (Alternative) Text for Images."
      },
      {
        "type": "p",
        "content": "If your client provides you with the image or asks you to use ‘visuals’ in the blog post, they must be SEO-optimized. ALT text makes this possible. Alternative text means the “description of the image.” In other words, you have to describe the image in words."
      },
      {
        "type": "p",
        "content": "Most users/readers will never actually see the ALT text (it’s hidden in the code of an image tag), but if, due to some reason (slow site loading speed or slow internet of the user), the image does not load, the user/reader will be able to see the description of the image."
      },
      {
        "type": "p",
        "content": "ALT text is also important for Web Accessibility. There are people with disabilities (blindness) who use the Internet with screen-reading technology… so a descriptive image (image with ALT text) helps them ‘visualize’ what’s in the image."
      },
      {
        "type": "p",
        "content": "Now think about this….how will you describe a visual to a blind person? That’s exactly how you should write your ALT text."
      },
      {
        "type": "p",
        "content": "Here is how you write absolute killer ALT texts."
      },
      {
        "type": "p",
        "content": "Here is what to 100% avoid;"
      },
      {
        "type": "p",
        "content": "If you are new and have never written any ALT text for an image, practice it. Take any image from Google and try to describe it concisely and clearly within 20-30 words."
      },
      {
        "type": "h3",
        "content": "Keyword Placement in Headings and Text"
      },
      {
        "type": "p",
        "content": "Are you familiar with Keyword Stuffing?"
      },
      {
        "type": "p",
        "content": "Yes, that is a decade-old concept. Some people think it still works. That’s why I get questions and complaints like;"
      },
      {
        "type": "p",
        "content": "You need to integrate keywords naturally and organically so readers don’t get annoyed."
      },
      {
        "type": "p",
        "content": "This is one of the major requirements of ‘people-first’ content. And when you ‘stuff’ keywords, your reader gets to know it right there."
      },
      {
        "type": "p",
        "content": "Now, that does not mean you forget about keywords and write whatever comes to you."
      },
      {
        "type": "p",
        "content": "As an SEO writer, it's your job to write strategically. In addition to primary keywords, you have secondary keywords and LSIs (remember them? If not, go back and revise). So, your content must have primary and secondary keywords and LSI terms. That’s where you need to be strategic."
      },
      {
        "type": "p",
        "content": "Typically, the Keyword Density is 1-2%, meaning you should use a keyword once after every 100 words (but again, only if that makes sense)."
      },
      {
        "type": "p",
        "content": "Similarly, keywords in headings are important only if they naturally fit in. It also depends on the topic you’re writing on. For instance, if it’s a how-to guide…your headings will revolve around the primary keyword so you can easily cover the keywords in H2s. But if it’s a listicle, you cannot cover the primary keyword as it is (most of the time)."
      },
      {
        "type": "p",
        "content": "Here is what you can do to optimize your headings for SEO;"
      },
      {
        "type": "p",
        "content": "The heading/subheading should be the crux of the body so that if a reader is in a rush and doesn’t want to read the whole thing you wrote under the heading, they get an idea from the heading itself. It’s a best practice to optimize your content for skimmers. It also increases readability."
      },
      {
        "type": "p",
        "content": "You don’t always need to include keywords in the headings. You can use variations and synonyms (also known as LSIs).  Google gets the idea through the context of the content of what you’re talking about."
      },
      {
        "type": "p",
        "content": "Heading hierarchy is the order of the headings and subheadings."
      },
      {
        "type": "p",
        "content": "There should be ONLY one H1 in your blog post (we often call it the title page or SEO title)."
      },
      {
        "type": "p",
        "content": "After H1, all major headings are H2s. Any subpoint/subheading in an H2 will be H3 (and any subpoint in H3 will be H4, and so on)."
      },
      {
        "type": "p",
        "content": "H1. (The title of the blog post)"
      },
      {
        "type": "p",
        "content": ">H2 (The first major heading after H1)"
      },
      {
        "type": "p",
        "content": ">H3 (The subheading of the H2 or the subpoint that you want to cover in H2)"
      },
      {
        "type": "p",
        "content": ">H4 (The subheading you want to cover in H3)"
      },
      {
        "type": "p",
        "content": ">H2 (Another major heading)"
      },
      {
        "type": "p",
        "content": "And the structure follows like this."
      },
      {
        "type": "p",
        "content": "Most of the time, we don’t need to go to H4. And the best practice is to stop on H3 anyway. Make a bullet list if you have further info/subpoints in H3 to discuss."
      },
      {
        "type": "h3",
        "content": "Internal and External linking"
      },
      {
        "type": "p",
        "content": "Internal or interlinking links a specific blog post to others on the SAME website."
      },
      {
        "type": "p",
        "content": "External or outbound links link your blog post to similar or relevant blog posts on a DIFFERENT domain/website."
      },
      {
        "type": "p",
        "content": "There is no rocket science here. It’s simple."
      },
      {
        "type": "p",
        "content": "Why do we do it?"
      },
      {
        "type": "p",
        "content": "Two reasons;"
      },
      {
        "type": "p",
        "content": "So, you see? You don’t just take any word or phrase and put a hyperlink to it….you only do it when it makes sense and is helpful both for the reader and Google."
      },
      {
        "type": "p",
        "content": "If you are writing on a given keyword or topic and your client asks you to put interlinks and external links, the first thing you do after writing the blog post is find the anchor text."
      },
      {
        "type": "p",
        "content": "Anchor (as the word itself indicates, that ‘something used to hold another thing firmly/securely) text is the phrase or word you hyperlink to another blog post."
      },
      {
        "type": "p",
        "content": "Let's say your client’s niche is health and nutrition, and you’re assigned to write a blog post with the keyword “low-calorie healthy diet.” Healthy diet is the main keyword here, and you’ve got to include internal and external links."
      },
      {
        "type": "p",
        "content": "Here are some types of anchor texts you can look out for;"
      },
      {
        "type": "p",
        "content": "This anchor text type uses the keyword or phrase you’re targeting for SEO. For example, if your keyword is \"healthy diet,\" you would use \"healthy diet\" as the anchor text and find another blog post on the website written on/about healthy diet."
      },
      {
        "type": "p",
        "content": "This includes a variation of the keyword you’re targeting. For example, \"benefits of a healthy diet\" if your main keyword is \"healthy diet.\""
      },
      {
        "type": "p",
        "content": "This uses your brand name as the anchor text, such as \"greenlife,\"  and you can hyperlink to the company's About or Home page."
      },
      {
        "type": "p",
        "content": "This uses non-descriptive text like \"click here\" or \"read more.\""
      },
      {
        "type": "p",
        "content": "ALWAYS void this type of anchor text."
      },
      {
        "type": "p",
        "content": "This type of anchor text uses synonyms or related terms to provide context. For example, if your keyword is \"healthy diet,\" you might use \"nutritious eating habits\" as semantic anchor text."
      },
      {
        "type": "p",
        "content": "This involves embedding the link within a sentence or phrase that naturally fits the context of your content. It helps provide a smooth reading experience and is highly effective for SEO. For example, \"To maintain a balanced diet, you should eat more nutrient-rich foods. (hyperlink the sentence to a blog post about a balanced diet and nutrient-rich foods)."
      },
      {
        "type": "p",
        "content": "The anchor text selection criteria are the same for both internal and external links."
      },
      {
        "type": "p",
        "content": "But remember;"
      },
      {
        "type": "h2",
        "content": "2): Satisfy EEAT as a Generalist Writer"
      },
      {
        "type": "p",
        "content": "This is one of the most debated topics after Google’s Helpful Content Update (HCU)."
      },
      {
        "type": "p",
        "content": "I’ll be short and quick here and try my best to make it easy for you."
      },
      {
        "type": "p",
        "content": "First of all, what the hell is EEAT?"
      },
      {
        "type": "p",
        "content": "It’s an acronym for;"
      },
      {
        "type": "p",
        "content": "E = Experience"
      },
      {
        "type": "p",
        "content": "E = Expertise"
      },
      {
        "type": "p",
        "content": "A = Authoritativeness"
      },
      {
        "type": "p",
        "content": "T = Trustworthiness"
      },
      {
        "type": "p",
        "content": "Let’s briefly translate what this ‘vague’ acronym is trying to say;"
      },
      {
        "type": "p",
        "content": "‘The content creator (writer) has (first-hand) experience and expertise in the topic. The content has authority and is trustable."
      },
      {
        "type": "p",
        "content": "Well, this is what it apparently sounds like."
      },
      {
        "type": "p",
        "content": "Is EEAT an SEO factor?"
      },
      {
        "type": "p",
        "content": "No. Not a direct one."
      },
      {
        "type": "p",
        "content": "It’s part of how Google evaluates the quality of your content. Google published its quality rating guideline for the first time in 2013. In 2014, they introduced E-E-T. In December 2022, they added another E for ‘experience’."
      },
      {
        "type": "p",
        "content": "So, EEAT is a component of Google’s Search Quality Rater Guidelines (SQRG is Google’s 170-page lengthy guide; you can find it on the Google Search Central Blog)."
      },
      {
        "type": "p",
        "content": "Google mentioned two kinds of ratings;"
      },
      {
        "type": "p",
        "content": "Everything (technical and non-technical)  on the web page, including content and visuals."
      },
      {
        "type": "p",
        "content": "The users’ search needs."
      },
      {
        "type": "p",
        "content": "Did they get the information they were looking for?"
      },
      {
        "type": "p",
        "content": "Did they find the specific product/service they were looking for?"
      },
      {
        "type": "p",
        "content": "Etc."
      },
      {
        "type": "p",
        "content": "Google uses the EEAT formula to check the content against these ratings. Google gets this rating from the OVERALL website content, domain authority, links, etc."
      },
      {
        "type": "p",
        "content": "Another important point that you should know here is that EEAT is more applicable to YMYL (Your Money, Your Life) niches. YMYL niches cover topics that directly impact someone’s life, such as financial conditions, well-being, etc. (You can also Google this phrase). In these topics, a writer’s opinion, expertise, and experience could really impact the user’s life."
      },
      {
        "type": "p",
        "content": "So, the content in these niches must be specifically reliable or EEAT-aligned."
      },
      {
        "type": "p",
        "content": "So, even if EEAT is not a direct ranking factor, it does contribute to rankings. EEAT-aligned content will definitely get better rankings than non-EEAT-aligned content."
      },
      {
        "type": "p",
        "content": "Although Google evaluates the overall content of a website against EEAT, a single blog post also has EEAT elements."
      },
      {
        "type": "p",
        "content": "And that’s where you as an SEO content writer, play your role to help your client get EEAT-aligned content."
      },
      {
        "type": "p",
        "content": "Let’s see how."
      },
      {
        "type": "p",
        "content": "How do you (as an SEO writer for your clients) satisfy EEAT, especially when you are a generalist writer and don’t have firsthand experience/expertise in the niche?"
      },
      {
        "type": "p",
        "content": "See, we are not concerned with how much content the website already has, the domain authority, or links."
      },
      {
        "type": "p",
        "content": "Let’s assume you are writing on a provided topic/keyword and don’t know how and when your client will publish the content. They are not going to give you bylines (when the client gives you credit and mentions you as their SEO writer on their site). So, how will you satisfy EEAT as a writer?"
      },
      {
        "type": "p",
        "content": "Let’s dive in one by one."
      },
      {
        "type": "h3",
        "content": "E = Experience"
      },
      {
        "type": "p",
        "content": "Let me rephrase this for you;"
      },
      {
        "type": "p",
        "content": "It’s basically ‘the first-hand experience of a writer.’"
      },
      {
        "type": "p",
        "content": "A blog post that includes real-life data, examples, instances, and use cases is more effective than one that only has no data and generic, surface-level content."
      },
      {
        "type": "p",
        "content": "The depth of the content shows the writer's ‘experience’. The logicality and practicality of the real-life use cases and examples also show how much real-life experience the writer has."
      },
      {
        "type": "p",
        "content": "But here is the thing…"
      },
      {
        "type": "p",
        "content": "You can’t possibly have the ‘first-hand’ experience of every topic you write as an SEO writer. That’s where your research skills come in."
      },
      {
        "type": "p",
        "content": "Yes, RESEARCH is a SKILL."
      },
      {
        "type": "p",
        "content": "So…If your research is good, you can;"
      },
      {
        "type": "p",
        "content": "But keep in mind that you can’t fake experience. They say ‘experience speaks. ' So always try to get the real experience. Spend some time (even if you already know it) with the topic and learn about it."
      },
      {
        "type": "h3",
        "content": "E = Expertise"
      },
      {
        "type": "p",
        "content": "Let me rephrase it for you;"
      },
      {
        "type": "p",
        "content": "“The expertise of a writer as a subject matter expert”."
      },
      {
        "type": "p",
        "content": "I call it the ability to simplify complex topics so your target audience can clearly understand. An expert is one who knows how to convey the message (or information) in a digestible, easy-to-understand way."
      },
      {
        "type": "p",
        "content": "Also, the expert knows how to convince and persuade readers (especially if you are writing something with a commercial intent)."
      },
      {
        "type": "p",
        "content": "You don’t have to tell your readers you’re an expert…you need to show them through your words."
      },
      {
        "type": "p",
        "content": "It’s like ‘walk the talk."
      },
      {
        "type": "p",
        "content": "All you have to do is;"
      },
      {
        "type": "p",
        "content": "- Use the most persuasive content angle (the best way possible to convey your message/information)."
      },
      {
        "type": "p",
        "content": "- Write in the language of your target audience"
      },
      {
        "type": "p",
        "content": "When you spend enough time on any topic, you can develop expert-level knowledge. Again…it depends on your research skills."
      },
      {
        "type": "h3",
        "content": "A = Authoritativeness"
      },
      {
        "type": "p",
        "content": "(NOTE: Authority highly refers to the site…and your client…"
      },
      {
        "type": "p",
        "content": "But as a writer I believe that we can still contribute to it."
      },
      {
        "type": "p",
        "content": "Who are you as a writer? Does your profile complement what you’re talking about?"
      },
      {
        "type": "p",
        "content": "For instance, at the start of this guide, I wrote my short intro…and it made you read until now. That's my authority as a writer."
      },
      {
        "type": "p",
        "content": "But you can’t write your intro in every blog post…and what if your client does not credit you with the bylines (mention you as the writer on their blog page and interlink your social profiles)?"
      },
      {
        "type": "p",
        "content": "You can still show your authority in a single blog post."
      },
      {
        "type": "p",
        "content": "How?"
      },
      {
        "type": "p",
        "content": "You probably have forgotten who I am…but while you are reading the content, something in it is telling you that I have the ‘authority’ to write what I’m writing."
      },
      {
        "type": "p",
        "content": "Confidence."
      },
      {
        "type": "p",
        "content": "You need to be confident in your tone, style, and the way you structure sentences and paragraphs."
      },
      {
        "type": "p",
        "content": "All this gives the reader an authoritative impression of the writer. And they call it ‘concieved authority.’"
      },
      {
        "type": "p",
        "content": "If the writer has an online presence (and is known by something), this is called perceived credibility. For instance, Neil Patel is a known digital marketer. When you read a blog post about digital marketing written by him, you believe in what he writes."
      },
      {
        "type": "p",
        "content": "BUT…"
      },
      {
        "type": "p",
        "content": "As I said, authority (in Google’s terms)...is the overall authority of the website."
      },
      {
        "type": "p",
        "content": "How many people are referring to that website or a single page? Also known as the backlinks."
      },
      {
        "type": "p",
        "content": "Google gets the authority signals by looking at whether other (websites) are recognizing your website as an authority."
      },
      {
        "type": "p",
        "content": "But again…"
      },
      {
        "type": "p",
        "content": "People will only refer to your website if it has high-quality, valuable, and helpful content."
      },
      {
        "type": "p",
        "content": "(People buy backlinks to show authority…but one only gets highly relevant and beneficial backlinks if the content is well written)."
      },
      {
        "type": "p",
        "content": "At the end of the day, the ball’s in your court as a writer."
      },
      {
        "type": "h3",
        "content": "T = Trustworthiness"
      },
      {
        "type": "p",
        "content": "I can rephrase it to;"
      },
      {
        "type": "p",
        "content": "“The honesty and truthfulness of a writer.”"
      },
      {
        "type": "p",
        "content": "Your content is trustworthy enough if you’re:"
      },
      {
        "type": "p",
        "content": "Trustworthiness also depends on the site somehow. For example, the website is secure, and consumers/readers' protection is strong and up-to-date. The website has a smooth and clean UX and UI, etc."
      },
      {
        "type": "h2",
        "content": "3): Content Readability"
      },
      {
        "type": "p",
        "content": "Generally readability means that your content is readable for ANYONE who is reading the content. For this, we usually consider the following two pointers;"
      },
      {
        "type": "p",
        "content": "Sentence structure and length"
      },
      {
        "type": "p",
        "content": "The sentence should be clear and meaningful. Here is what I do to make sure clarity and meaningfulness in a sentence;"
      },
      {
        "type": "p",
        "content": "Daily-life easy-to-understand vocabulary"
      },
      {
        "type": "p",
        "content": "Fancy and academic vocabulary make the content hard to read. So, use words and phrases that you use in your daily life conversations. For instance, instead of ‘integral,’ use ‘important.’"
      },
      {
        "type": "p",
        "content": "The objective is to make your writing EASY in your reader’s eyes. So, if they’re in a hurry or skimming/scanning your content, their mind can quickly process words and their meanings."
      },
      {
        "type": "p",
        "content": "That’s why you’re often told that write for a 7th grader."
      },
      {
        "type": "p",
        "content": "I use the Hemingway editor to evaluate the hard-to-read words/phrases and lengthy sentences."
      },
      {
        "type": "p",
        "content": "Grammarly also tells you readability and content performance scores. You can use that, too. It also gives you suggestions to rewrite the sentences."
      },
      {
        "type": "p",
        "content": "All of this is a general conception regarding readability. Which is not wrong or irrelevant and you must make your content easy to understand and read. The only logic behind this readability concept is that readers usually have very disturbed concentration (they’d be juggling with so much stuff in their head), so they must think about WHAT you’re writing – not about HOW you’re writing it."
      },
      {
        "type": "p",
        "content": "But readability is NOT just easier vocabulary and simple sentence structure."
      },
      {
        "type": "p",
        "content": "Readability means your content is “understandable” for your “TARGET” reader."
      },
      {
        "type": "p",
        "content": "Depending on the topic and niche, your reader’s “reading level” varies. That means something understandable for one type of reader may not be readable for another type. For instance, if I am writing a technical blog post in a cybersecurity niche, and using industry jargon and niche terms, then chances are that my content would not make much sense to someone who does not know anything about cybersecurity."
      },
      {
        "type": "p",
        "content": "On the other hand, if you use daily life lingo and vocabulary while writing for someone who is pretty knowledgeable about the niche, you will sound fluff and irrelevant."
      },
      {
        "type": "p",
        "content": "You get the idea."
      },
      {
        "type": "p",
        "content": "That said, the 7th-grader formula can’t be implemented here. Your objective is to make your content easy to read for your target audience, whether their level is 7th or 12th—it doesn’t matter."
      },
      {
        "type": "p",
        "content": "Considering this, the readability of a blog post totally depends on the topic and the target reader. Now;"
      },
      {
        "type": "p",
        "content": "So, how do you ensure that the content you’re writing is readable for your target audience?"
      },
      {
        "type": "p",
        "content": "Before you start writing, ask yourself;"
      },
      {
        "type": "p",
        "content": "The readability rule of thumb while writing a blog post is that your content must be “compatible” with your reader’s reading level."
      },
      {
        "type": "p",
        "content": "No rocket science at all. It's as simple as how you write differently when texting a friend than writing an email to your boss or client."
      },
      {
        "type": "h2",
        "content": "4): Writing Tone"
      },
      {
        "type": "p",
        "content": "Writing tone refers to how your content \"sounds\" to your reader. It shapes how the message is perceived and can influence/trigger the reader’s engagement and response."
      },
      {
        "type": "p",
        "content": "There are four common tones to choose from:"
      },
      {
        "type": "h3",
        "content": "Professional & Formal"
      },
      {
        "type": "p",
        "content": "This tone is serious, factual, and structured. It is often used when dealing with highly technical or specialized topics. If your objective is to establish authority and credibility, this tone is the ideal."
      },
      {
        "type": "p",
        "content": "It is often used in niches like finance, legal, or B2B (business addressing another business) communications."
      },
      {
        "type": "h3",
        "content": "Informal & conversational"
      },
      {
        "type": "p",
        "content": "This tone feels more relaxed and approachable, like conversing with a friend. It’s great for making complex ideas easier to understand and helps create a personal connection with readers."
      },
      {
        "type": "p",
        "content": "This tone is ideal for Lifestyle blogs, how-to guides, and casual product reviews. It is also suitable for B2C (business addressing customers or consumers) audiences."
      },
      {
        "type": "h3",
        "content": "Inspiring & motivational"
      },
      {
        "type": "p",
        "content": "This writing tone is a good fit for a blog post if you want your reader to encourage, inspire, or motivate you."
      },
      {
        "type": "p",
        "content": "This tone is mainly employed for self-improvement topics. It can also be used for Personal development blogs, fitness and wellness articles, and motivational content for B2C audiences."
      },
      {
        "type": "h3",
        "content": "Sarcastic & humorous"
      },
      {
        "type": "p",
        "content": "Use this tone If you want to add wit, sarcasm, and fun to your content. It’s less formal and often used to address topics playfully or critically without sounding too serious."
      },
      {
        "type": "p",
        "content": "This is best for entertainment blogs, edgy brand marketing, or content that targets a younger audience (GenZ). It is suitable for B2C but rare for B2B unless the brand culture aligns."
      },
      {
        "type": "p",
        "content": "IMPORTANT NOTE:"
      },
      {
        "type": "p",
        "content": "There is no one-size-fits-all tone for a specific industry. It always depends on the objective and the purpose of writing. Sometimes you need to mix two tones. For example, I often use a professionally engaging tone for B2B blogs. And sometimes, I use a formally conversational tone for B2C blogs."
      },
      {
        "type": "p",
        "content": "Remember, just like readability, the writing tone depends on the audience you’re targeting."
      },
      {
        "type": "p",
        "content": "But you MUST keep your writing tone consistent throughout the blog post.  If it's formal and professional at the start, the blog post must end in this same tone."
      },
      {
        "type": "p",
        "content": "Also, keep your narrative tone consistent (First person as “I”, “me”, and second person as “you”, “your”)."
      },
      {
        "type": "p",
        "content": "Now the question is, how do you write differently for different clients? In other words, how do you ensure that your content will serve your client’s target readers?"
      },
      {
        "type": "p",
        "content": "I’ll tell you precisely in the next pointer."
      },
      {
        "type": "h2",
        "content": "5): Research your Client’s Target Audience"
      },
      {
        "type": "p",
        "content": "Effective and impactful writing occurs when you write to a specific group of people, describing their problems and presenting them with one solution."
      },
      {
        "type": "p",
        "content": "They say; that when your content is for EVERYBODY, it’s for NOBODY."
      },
      {
        "type": "p",
        "content": "You must have heard phrases like “speak to your target audience,” “hit their pain points,” etc. But how?"
      },
      {
        "type": "p",
        "content": "How do you determine and find the target audience for your blog post?"
      },
      {
        "type": "p",
        "content": "In other words, how do you find your client’s target audience?"
      },
      {
        "type": "p",
        "content": "Here are my 3 best practices;"
      },
      {
        "type": "h3",
        "content": "Ask my client whom they want to write to & WHY."
      },
      {
        "type": "p",
        "content": "Especially when I onboard a new client, I ask them to schedule a meeting and ask questions about their expectations, objectives, and target audience."
      },
      {
        "type": "p",
        "content": "Because, at this point, only my client knows their TA better than anyone else."
      },
      {
        "type": "p",
        "content": "I will send a simple, sleek questionnaire if a call is impossible."
      },
      {
        "type": "p",
        "content": "And if they’re too busy to fill out the questionnaire…I ask them on chat. I ask short, specific, and quick questions."
      },
      {
        "type": "p",
        "content": "There’s no way my client could escape from this phase."
      },
      {
        "type": "h3",
        "content": "I do my research."
      },
      {
        "type": "p",
        "content": "Yeah obv."
      },
      {
        "type": "p",
        "content": "I am writing a blog post on the best email marketing tips for newbies. My TA is a newbie marketer or someone who is not a marketer (yet) and is looking for tips."
      },
      {
        "type": "p",
        "content": "I’ll search for what kind of problem a newbie faces…or what type of problems an email marketer usually faces. I’ll read the reviews under different marketing tools….I’ll search on Quora, Redditt & socials. I’ll ask my marketer friend. I’ll go to YT (YouTube)… and read comments under YT videos."
      },
      {
        "type": "p",
        "content": "When I have a list of 10-15 problems, I will research how professional marketers handle these problems….and their solutions will be my tips."
      },
      {
        "type": "p",
        "content": "See…how natural I am :)"
      },
      {
        "type": "h3",
        "content": "I IMPERSONATE as the TA."
      },
      {
        "type": "p",
        "content": "This is easy for me as I have read, lived, & absorbed literature for 4 good years."
      },
      {
        "type": "p",
        "content": "Impersonation, in other words, is putting yourself in the shoes of the next person."
      },
      {
        "type": "p",
        "content": "Writing a blog for sleep-deprived people? Feel like a sleep-deprived person."
      },
      {
        "type": "p",
        "content": "Writing a post for non-techies? Imagine you know nothing about tech."
      },
      {
        "type": "p",
        "content": "Writing a post for a recently married couple? Ok, I can’t impersonate that yet:)"
      },
      {
        "type": "p",
        "content": "You get the point, right?"
      },
      {
        "type": "p",
        "content": "Tip for improving your writing tone and flow"
      },
      {
        "type": "p",
        "content": "Read out loud your content piece…"
      },
      {
        "type": "p",
        "content": "“Write like you speak” is 99.9% misleading. If I wrote exactly how I speak, you’d see a lot of \"aaan —ummms\" and \"errmmm\" in my writing."
      },
      {
        "type": "p",
        "content": "Instead, write like you wish to speak—this is where you refine your writing. It helps create a smooth flow, catch obvious errors, and assess your tone."
      },
      {
        "type": "p",
        "content": "All you have to do is listen to what you've written. You can read your content aloud or have someone else read it. If you’re not confident in your pronunciation or fluency, use a text-to-speech tool to help."
      },
      {
        "type": "h2",
        "content": "6): Content Angle/Perspective"
      },
      {
        "type": "p",
        "content": "Here is how I put this;"
      },
      {
        "type": "p",
        "content": "There are hundreds of ways to discuss a certain topic, and a writer chooses the BEST way to present it."
      },
      {
        "type": "p",
        "content": "So, The way you choose to present your message in a blog post is known as the content angle or perspective. This distinguishes a seasoned writer from a novice or non-writer."
      },
      {
        "type": "p",
        "content": "You don’t just tell the reader something—you communicate it in the most compelling and impactful way possible. That’s the difference between writing something people read versus something people remember."
      },
      {
        "type": "p",
        "content": "Although the concept is applicable even on a sentence level, let’s see some common content angles that we usually use in blog posts."
      },
      {
        "type": "h3",
        "content": "Common Content Angles in Blog Posts"
      },
      {
        "type": "p",
        "content": "There are several ways to frame your content, and the right angle depends on your audience and purpose."
      },
      {
        "type": "p",
        "content": "Consider these angles when writing your next blog post;"
      },
      {
        "type": "p",
        "content": "Storytelling:"
      },
      {
        "type": "p",
        "content": "A narrative-driven approach that engages the reader emotionally. This angle is powerful for B2C content. I call it suitable for H2H (human-to-human) content.  It pulls readers in and makes the content relatable."
      },
      {
        "type": "p",
        "content": "Fact/Stat Presenter:"
      },
      {
        "type": "p",
        "content": "A more objective, data-driven approach is ideal for (and normally used in) a B2B audience or when the writer needs to establish credibility. It appeals to logic and reason by presenting factual, straightforward information."
      },
      {
        "type": "p",
        "content": "Opinionated:"
      },
      {
        "type": "p",
        "content": "Here, the writer takes a stance, sharing personal insights or bold opinions. This angle sparks conversations and debates. It's great for thought leadership pieces or niche topics where you want to stand out."
      },
      {
        "type": "p",
        "content": "Problem-Solution:"
      },
      {
        "type": "p",
        "content": "Focused on identifying a problem and offering a solution. This works well for product reviews, how-to guides, and tutorials."
      },
      {
        "type": "p",
        "content": "Again, remember that the content angle should always align with your objective and target audience. If your blog post is for normal human beings in daily life, use the storytelling angle. If you are writing for a business-minded audience, use the fact/stat presenter angle."
      },
      {
        "type": "p",
        "content": "Maintain a Consistent Content Angle Throughout the Blog Post."
      },
      {
        "type": "p",
        "content": "Once you choose a content angle, stick with it throughout the blog post. A common mistake I have seen is switching between angles, for instance, starting with a story and abruptly jumping into hard facts. It confuses readers and affects effectiveness."
      },
      {
        "type": "p",
        "content": "The angle needs to be balanced and woven into every section, from the introduction to the conclusion."
      },
      {
        "type": "h2",
        "content": "7): Blog Post Formatting (for skimmers and scanner)"
      },
      {
        "type": "p",
        "content": "SEO content writing (blog posts and/or articles) is different from all other types and kinds of writing."
      },
      {
        "type": "p",
        "content": "You write fiction books for book nerds."
      },
      {
        "type": "p",
        "content": "You write creative stuff for writing lovers."
      },
      {
        "type": "p",
        "content": "You write academic stuff for professors (& they don’t read:)."
      },
      {
        "type": "p",
        "content": "NONE of them requires you to format it properly. You can have long sentences, stretchy sentences, big walls of texts and no one will get bothered."
      },
      {
        "type": "p",
        "content": "But SEO writing….that’s a totally different ball game."
      },
      {
        "type": "p",
        "content": "You write blog posts to inform, educate, or promote something. And there you deal with skimmers and scanners. There you have to convey your message to those who are on the internet and they have 100s of other relatively better options than to read your blog post."
      },
      {
        "type": "p",
        "content": "Their attention span is short. They are in a hurry."
      },
      {
        "type": "p",
        "content": "And that’s where you need to format your post so that you can easily convey your message to skimmers and scanners."
      },
      {
        "type": "p",
        "content": "Tell me, how will you write to someone you know is in a hurry, busy and short of time?"
      },
      {
        "type": "p",
        "content": "You will not write anything unnecessary → straight to the point."
      },
      {
        "type": "p",
        "content": "You will highlight what is most important → emphasize main points."
      },
      {
        "type": "p",
        "content": "You will write in clear & simple vocabulary → easy to read"
      },
      {
        "type": "p",
        "content": "You will try to be as concise as possible → no fluff."
      },
      {
        "type": "p",
        "content": "This applies to the overall blog post."
      },
      {
        "type": "p",
        "content": "Here is the universal structure of any blog post (or any writing in this case)."
      },
      {
        "type": "h3",
        "content": "The introduction section…(first H2)"
      },
      {
        "type": "p",
        "content": "The most important part of your blog post is where you should spend 60% of your time (not a rule but my personal theory)."
      },
      {
        "type": "p",
        "content": "Why? The first 100-130 words are enough to make your reader realize whether the next 800-1000 words are going to be worth their 4-5 minutes or not."
      },
      {
        "type": "p",
        "content": "Some SEO writers writes the introduction section when they are done with the rest of the blog post."
      },
      {
        "type": "p",
        "content": "But I don’t do that. And I write the intro section in a way that it does not sound like an intro at all."
      },
      {
        "type": "p",
        "content": "(Who needs the 100-130 words just to tell what is in the next 800 words?...NO ONE)."
      },
      {
        "type": "p",
        "content": "For short blog posts (600-1000 words)...get straight to the point and make your readers feel understood…talk about their pain points, problems. Take them to their ideal/desired situation."
      },
      {
        "type": "p",
        "content": "Honestly, there is no set frameworks for writing a good introduction section of a blog post. You can use some copywriting frameworks like AIDA (Attention→Interest→Desire→Action), PAS (Problem→Agitate→Solution) ... etc."
      },
      {
        "type": "p",
        "content": "But every blog post is different with a unique purpose, so you should not limit yourself to any formula. Just make sure your research is top notch, you know the best content angle and this first section is engaging and valuable enough."
      },
      {
        "type": "p",
        "content": "Some writers (including me), often use a proper H2 just after the H1 (or SEO title) for the introduction section instead of writing a vague heading as “introduction” or having no heading at all (for instance, after the H1…write the introductory lines and then jump to the body of the blog post)."
      },
      {
        "type": "p",
        "content": "I use a proper subheading (as H2). For instance if I am writing a blog post on “How to Be More Productive”, I’d write “Productivity is Not an Accident”  as my H2 for the introduction section."
      },
      {
        "type": "h3",
        "content": "The Body (x main points)"
      },
      {
        "type": "p",
        "content": "This is where you have to deliver THE best…it’s the meat of your blog post."
      },
      {
        "type": "p",
        "content": "One of the most important things to consider here is the heading hierarchy."
      },
      {
        "type": "p",
        "content": "Remember, there is always ONLY one H1 in your blog post which we often use as the SEO title as well. Every major heading after that comes under H2. And any sub point in H2 comes under H3 and any sub point in H3 comes under H4….(but we rarely need to go beyond H3, unless the topic is 5k words how to guide)."
      },
      {
        "type": "p",
        "content": "Let say you’re writing a blog post in productivity niche on a topic ‘How To Be More Productive.’"
      },
      {
        "type": "p",
        "content": "Your H1 will be →  How To Be More Productive and Get your Work Done Faster"
      },
      {
        "type": "p",
        "content": "The first H2 (for intro section) will be → Productivity is not an Accident"
      },
      {
        "type": "p",
        "content": "Second H2 (for body section) will be → Top 8 Productivity Tips You Can Try Right Now"
      },
      {
        "type": "p",
        "content": "Now, each Tip will be a H3."
      },
      {
        "type": "p",
        "content": "And if in any H3, we have an important subpoint we can use H4. But in our case, we are good with H3s."
      },
      {
        "type": "p",
        "content": "This is normally what structuring a post means. But there is more to it."
      },
      {
        "type": "p",
        "content": "Here are 4 other most important points you must consider."
      },
      {
        "type": "p",
        "content": "In long listicles…you don’t need to explain each point in detail."
      },
      {
        "type": "p",
        "content": "For instance you’re writing a how to guide and it includes 15 step….better to write each point within 100-150 words limit (or max 200 if a specific step really needs explanation)."
      },
      {
        "type": "p",
        "content": "It makes your writing concise, sharp and no-fluff."
      },
      {
        "type": "p",
        "content": "There must be a balance of length (or word count in each section)."
      },
      {
        "type": "p",
        "content": "For instance, in our example of “How To Be More Productive and Get your Work Done Faster” the 8 tips’ section must have almost equal word count for each tip."
      },
      {
        "type": "p",
        "content": "If your first tip is 150 words and the second is 250-300…it will sound awkward and disorganized."
      },
      {
        "type": "p",
        "content": "But yes…10-20 word fluctuation is acceptable."
      },
      {
        "type": "p",
        "content": "Always keep in mind this rule of thumb…"
      },
      {
        "type": "p",
        "content": "What does that mean? Your blog post should satisfy ONE specific purpose from start to end, addressing one group/sect/type of audience."
      },
      {
        "type": "p",
        "content": "A good content is one which takes your reader from point A to point B…strategically, point by point, slowly, in a linear direction."
      },
      {
        "type": "p",
        "content": "If I am writing a blog post on “How To Be More Productive and Get your Work Done Faster”, I will NOT discuss “what is productivity” or “why you need to be productive”, or \"Benefits of productivity”."
      },
      {
        "type": "p",
        "content": "My blog post from intro to the last heading will focus on ‘how to be productive’ with practical tips, personal experiences and SMEs quotes."
      },
      {
        "type": "p",
        "content": "And my each tip will be the continuation of the previous one…a development. For instance, if my tip number 2 is about “Organize your day and create a to-do list”, the 3rd tip will be “Focus on the most important task first” and 4th will be “Don’t multitask”."
      },
      {
        "type": "p",
        "content": "You see? There is an order. One can’t prioritize the most important task without having a to-do list and the focus on the most important task automatically helps eliminate all other distractions, hence no multitasking."
      },
      {
        "type": "p",
        "content": "That’s what synchrony in content means."
      },
      {
        "type": "p",
        "content": "That’s a must for the sake of skimmers and scanners."
      },
      {
        "type": "p",
        "content": "Bold, All the important phrases and the sentences that are conveying the key message of your paragraph or a heading."
      },
      {
        "type": "p",
        "content": "But I have seen writers underlining and bolding just keywords or one or two words."
      },
      {
        "type": "p",
        "content": "The purpose of highlighting (by bolding, italicing, and underlining) is to make your most important sentence prominent. Don’t highlight the keywords or one or two word phrases."
      },
      {
        "type": "h3",
        "content": "The Conclusion Section"
      },
      {
        "type": "p",
        "content": "The word ‘conclusion’ here is misleading. It refers to “closing remarks,” “the ending,” or “summary.” But readers don’t want a conclusion for 800-1200 word blog posts."
      },
      {
        "type": "p",
        "content": "When I started SEO blog writing, I made these mistakes;"
      },
      {
        "type": "p",
        "content": "- Name the last heading as ‘conclusion’"
      },
      {
        "type": "p",
        "content": "- Write some ‘closing remarks’ at the end."
      },
      {
        "type": "p",
        "content": "- Or ‘wrap up’ my main arguments."
      },
      {
        "type": "p",
        "content": "- Or ‘summarize’ everything."
      },
      {
        "type": "p",
        "content": "Disclaimer: The intro, body, and conclusion sections vary from client to client, and there is no one-size-fits-all formula."
      },
      {
        "type": "p",
        "content": "Then I realized (after research, experiments, and reading top blogs) that 1). It’s an ineffective & weak approach, 2). Digital readers are skimmers & scanners, 3). The conclusion isn’t applicable in the short-form blog post"
      },
      {
        "type": "p",
        "content": "And I changed my approach."
      },
      {
        "type": "p",
        "content": "I started treating the last heading as a main heading."
      },
      {
        "type": "p",
        "content": "Now, I’d write a clear, catchy, complete sentence, and then, I’d use one of the following methods;"
      },
      {
        "type": "p",
        "content": "- Don’t say goodbye."
      },
      {
        "type": "p",
        "content": "- Keep it open-ended"
      },
      {
        "type": "p",
        "content": "- Add your ideas and analysis"
      },
      {
        "type": "p",
        "content": "- Add a ‘new perspective’"
      },
      {
        "type": "p",
        "content": "- Add a whole ‘new’ (but relevant) point"
      },
      {
        "type": "p",
        "content": "- Add meaningful takeaways."
      },
      {
        "type": "p",
        "content": "Usually, my last heading would be 8-12 lines."
      },
      {
        "type": "p",
        "content": "I use the last 2-3 lines for CTA → It complements my angle."
      },
      {
        "type": "p",
        "content": "(angle = one of three methods I just discussed)."
      },
      {
        "type": "p",
        "content": "Let me show you with my examples."
      },
      {
        "type": "p",
        "content": "Example #1: Synthesis"
      },
      {
        "type": "p",
        "content": "Blog post title:"
      },
      {
        "type": "p",
        "content": "How to Choose the Best Event Catering Service to Make Your Occasion Memorable"
      },
      {
        "type": "p",
        "content": "Last Heading:"
      },
      {
        "type": "p",
        "content": "<H2> Great Event at Affordable Price + Little Stress  = Success"
      },
      {
        "type": "p",
        "content": "There are two types of people celebrating events:"
      },
      {
        "type": "p",
        "content": "Those who are strategic and mindful when planning their catering. They save a lot of time and money."
      },
      {
        "type": "p",
        "content": "Those who are careless and lazy in planning their catering. They waste a lot of money and get stressed during the event."
      },
      {
        "type": "p",
        "content": "If you are more like the first type and have an event coming soon, you will love [BRAND] event catering services."
      },
      {
        "type": "p",
        "content": "If you want to talk or discuss your event directly, contact [BRAND]."
      },
      {
        "type": "p",
        "content": "Example #2: Final Extended main point"
      },
      {
        "type": "p",
        "content": "Blog Title;"
      },
      {
        "type": "p",
        "content": "5 (understated) Benefits of Flexible Work Arrangements"
      },
      {
        "type": "p",
        "content": "Last Heading:"
      },
      {
        "type": "p",
        "content": "<H2> The Work World is Changing…Are You?"
      },
      {
        "type": "p",
        "content": "A flexible work arrangement does not mean employees can do whatever they want. But now, with better means and improved tech, traditional workplaces or work schedules are a thing of the past. You must adapt to flexible work arrangements to be relatable and pursue sustainability."
      },
      {
        "type": "p",
        "content": "Your objective is to get the job done. You can do this without being a traditional boss. Your company needs a leader… visionary leader who knows how to get to the next level. Flexible workplaces are the new vision."
      },
      {
        "type": "p",
        "content": "If you need help improving your employees’ well-being, I am the right person to talk to. Please let me know how I can help you."
      },
      {
        "type": "p",
        "content": "Example #3: Cliffhanger"
      },
      {
        "type": "p",
        "content": "Blog Title:"
      },
      {
        "type": "p",
        "content": "4 Proven Ways to 10X Customer Services in Online Banking"
      },
      {
        "type": "p",
        "content": "Last Heading:"
      },
      {
        "type": "p",
        "content": "Treat Your Customer Like You Treat Your Best Friends"
      },
      {
        "type": "p",
        "content": "People are the backbone of any business. The ones who ignore people's involvement in any phase of the business face consequences."
      },
      {
        "type": "p",
        "content": "You care about your people =  people care about your brand."
      },
      {
        "type": "p",
        "content": "That’s the simplest equation in the business world."
      },
      {
        "type": "p",
        "content": "Customers are people…people with real problems…people with emotions. Online banking is the most sensitive industry, as you protect people’s money.  Make sure you never disappoint them."
      },
      {
        "type": "h2",
        "content": "8): The BLUF Approach for Writing Effectively"
      },
      {
        "type": "p",
        "content": "The BLUF (Bottom Line Upfront) approach, borrowed from military communication, is a straightforward and efficient method of conveying key information. It emphasizes placing the most critical message at the very start of your paragraph. The idea is to immediately give your readers the \"bottom line\" so they don’t have to dig through unnecessary details to understand the core point."
      },
      {
        "type": "p",
        "content": "We can use this approach on individual sections/paragraphs and on overall blog posts."
      },
      {
        "type": "p",
        "content": "Here is how;"
      },
      {
        "type": "p",
        "content": "How to Use the BLUF Approach in Paragraphs"
      },
      {
        "type": "p",
        "content": "To apply BLUF within a paragraph, start by distilling the most important idea and placing it at the beginning. Then, follow up with supporting information that expands on this core message. This keeps the writing sharp and to the point. It helps the readers The reader easily absorb the most relevant details."
      },
      {
        "type": "p",
        "content": "For example:"
      },
      {
        "type": "p",
        "content": "BLUF Approach: \"SEO content that focuses on user intent consistently ranks higher on Google.\""
      },
      {
        "type": "p",
        "content": "That’s your bottom line. Everything that follows should support and elaborate on this main point. You could then explain how Google’s algorithms prioritize content that matches search queries and give examples of how user intent drives search behavior."
      },
      {
        "type": "p",
        "content": "Contrast that with a more traditional approach, where you might build up to the main point gradually:"
      },
      {
        "type": "p",
        "content": "Traditional Approach:"
      },
      {
        "type": "p",
        "content": "\"As Google’s algorithms have evolved over the years, they’ve begun to focus more on the intent behind search queries. In response, content strategies have shifted to better align with what users are looking for. SEO content needs to prioritize user intent to rank well on Google.\""
      },
      {
        "type": "p",
        "content": "Notice how the key message is buried until the end."
      },
      {
        "type": "p",
        "content": "In SEO writing, readers (and search engines) appreciate when you get straight to the point."
      },
      {
        "type": "h2",
        "content": "9): VSO (Voice Search Optimized) Content"
      },
      {
        "type": "p",
        "content": "VSO is one of the most important yet ignored on-page SEO factors. If you live under a rock and don’t know what voice search is, open your Google, and inside the search bar, you’ll see a mic. Next time, instead of typing something, do a voice search, and you will see that for the same query, you get different results. VSO is important, and its need is growing because it improves visibility, builds trust, and gives sites rankings."
      },
      {
        "type": "p",
        "content": "Anyway ... how can you optimize content (as an SEO writer for your client)?"
      },
      {
        "type": "p",
        "content": "It’s unignorable."
      },
      {
        "type": "p",
        "content": "But you as a writer are not fully in control of VSO, especially if you don’t have any access to your client’s website."
      },
      {
        "type": "p",
        "content": "Here are some factors that directly impact VSO (and you can tell this to your client)."
      },
      {
        "type": "p",
        "content": "You as a writer, can follow these 3 best practices to optimize the content for voice search;"
      },
      {
        "type": "h3",
        "content": "Use Conversational Keywords"
      },
      {
        "type": "p",
        "content": "The way we speak is different from the way we write. So when you are writing about a topic, brainstorm phrases/questions one would normally use in their daily conversation."
      },
      {
        "type": "p",
        "content": "For example;"
      },
      {
        "type": "p",
        "content": "We type: Best laptop in Toronto"
      },
      {
        "type": "p",
        "content": "We speak: Where can I buy the best laptops in Toronto?"
      },
      {
        "type": "p",
        "content": "(You see? The voice query is more specific and longer. So Google shows more relevant and specific results)."
      },
      {
        "type": "p",
        "content": "You can find the “conversational keywords” or the questions from AnswerThePublic and Google’s autocomplete suggestions."
      },
      {
        "type": "p",
        "content": "Bonus Tip: Conversational keywords are likely the same as “long-tail keywords.”."
      },
      {
        "type": "h3",
        "content": "Analyze SERPs"
      },
      {
        "type": "p",
        "content": "Oh, no, not again, the whole SERP analysis. You only need to focus on:"
      },
      {
        "type": "p",
        "content": "What is the ranking of featured/rich snippets for the key phrase? And what is the format (listicle, bullet, paragraph, etc) of the FS. The length of a featured snippet is usually 45-55 words. So, in your blog post or article, you will write clear & concise answers in the same format within 45-55 words (but better ofc.)."
      },
      {
        "type": "p",
        "content": "You can use an H2 in your blog post (the title should be the question your reader is asking)."
      },
      {
        "type": "p",
        "content": "For instance, I did a voice search for “What is the battery time of an HP laptop”... look at the screenshot;"
      },
      {
        "type": "p",
        "content": "This section is important for overall analysis. In the PAA box, you see most questions for a specific query. Select two or three questions that you think you can cover in your blog post using a separate H2."
      },
      {
        "type": "p",
        "content": "For instance;"
      },
      {
        "type": "p",
        "content": "I searched for “What is the battery time of an HP laptop,” and in the PAA box, I saw people asking, “How long should 100% battery last” or “How many hours should an HP laptop battery last”... clearly, people want my “opinion” as an expert."
      },
      {
        "type": "p",
        "content": "So, if I were to write a blog post about HP laptop batteries…I’d cover these questions under “the battery lifespan of HP laptop” as an H2, and in H3, I’d give my opinion on “how long should an HP laptop battery last?”"
      },
      {
        "type": "p",
        "content": "You get the idea, right?"
      },
      {
        "type": "h3",
        "content": "Add an FAQs section"
      },
      {
        "type": "p",
        "content": "If you think there are some really important questions related to the topics, people are seriously asking….add an FAQ section."
      },
      {
        "type": "p",
        "content": "The length of your answer in the FAQ section doesn’t matter but when someone does a voice search…the Google assistant speaks 29 words. So, ideally, try to answer in less than 40 words. There is high possibility that your questions appear in a voice search."
      },
      {
        "type": "p",
        "content": "Remember that the tone of the content for voice search optimization is mostly conversational and informal to some extent."
      },
      {
        "type": "p",
        "content": "Google is becoming smart every day. They are incorporating AI in the mix to detect the most reliable, helpful, and relevant answers to the search queries."
      },
      {
        "type": "h2",
        "content": "10): AI detection …and how to get rid of it?"
      },
      {
        "type": "p",
        "content": "First off, if you are a newbie…I 100% strictly advise you to ban any AI writing tool on yourself. Declare it as your red zone. And never enter into it, until you know that now you are mature enough (have your writing tone and style and can play with words), and your writing won’t get affected by AI…and you are not reliant on any AI writing tool to complete your writing tasks. Take it to heart ...I said BAN…and I’m DAMN serious."
      },
      {
        "type": "p",
        "content": "Okay, now that that's said, what if you write manually but your content is detected as AI-generated content?"
      },
      {
        "type": "p",
        "content": "Many of my fellow junior (mid-level) SEO writers complain that “a client rejected my content because some AI detection tool caught AI in it….but I swear I wrote the content manually.” Then they ask how to get rid of it."
      },
      {
        "type": "p",
        "content": "So…first of all, I need you to understand is that…"
      },
      {
        "type": "p",
        "content": "And all AI writing tools are trained on some definite patterns."
      },
      {
        "type": "p",
        "content": "What pattern? For this, you need to understand how AI writing tools write…"
      },
      {
        "type": "p",
        "content": "AI writing tools…"
      },
      {
        "type": "p",
        "content": "- Don’t bend any writing rules"
      },
      {
        "type": "p",
        "content": "- Strictly follow grammar rules"
      },
      {
        "type": "p",
        "content": "- Mostly write in a formal tone"
      },
      {
        "type": "p",
        "content": "- Have the same pattern of writing each para"
      },
      {
        "type": "p",
        "content": "- Use a specific vocabulary for all kinds of topics"
      },
      {
        "type": "p",
        "content": "- Don’t have any STYLE or TONE even if you prompt one"
      },
      {
        "type": "p",
        "content": "(Weird when I read templates asking GPT to write in a specific tone)"
      },
      {
        "type": "p",
        "content": "Apart from this, AI has predictable writing patterns and a certain vocabulary. Phrases like ‘in today's fast-paced world,’ ‘Navigating the [landscape]/[complexities of],’ ‘Delving into the intricacies of…’ and many more like this (Google ‘ChatGPT overused words and phrases)..."
      },
      {
        "type": "p",
        "content": "These are fluff, unnecessary phrases, and words you usually don't use/write."
      },
      {
        "type": "p",
        "content": "You must study the AI pattern and develop your style and tone."
      },
      {
        "type": "p",
        "content": "Now;"
      },
      {
        "type": "p",
        "content": "You can’t write in the wrong grammar.  You can’t bend basic writing rules. You can’t always write in an informal tone."
      },
      {
        "type": "p",
        "content": "Your manually written content has all of the writing and grammar rules that AI uses."
      },
      {
        "type": "p",
        "content": "So, if your manually written content is detected as AI;"
      },
      {
        "type": "p",
        "content": "- It means your text pattern is the same as the AI."
      },
      {
        "type": "p",
        "content": "- You’ve used the vocabulary that AI often uses."
      },
      {
        "type": "p",
        "content": "Simple solution(s)?..."
      },
      {
        "type": "p",
        "content": "And…"
      },
      {
        "type": "p",
        "content": "It’s ok to start your sentence with And."
      },
      {
        "type": "p",
        "content": "It’s ok to end your sentence with a preposition."
      },
      {
        "type": "p",
        "content": "It’s ok to use ellipses and single-word sentences."
      },
      {
        "type": "p",
        "content": "AI DETECTION IS NOT A BAD THING…"
      },
      {
        "type": "p",
        "content": "Unless…"
      },
      {
        "type": "p",
        "content": "Your writing is not boring."
      },
      {
        "type": "p",
        "content": "You are conveying your message."
      },
      {
        "type": "p",
        "content": "You are being helpful and satisfying SI."
      },
      {
        "type": "p",
        "content": "And if your client has a fractured bone in their brain"
      },
      {
        "type": "p",
        "content": "And rely on AI detection tools more than their common sense…"
      },
      {
        "type": "p",
        "content": "And don’t believe in your writing prowess…"
      },
      {
        "type": "p",
        "content": "(Prowess is not an AI word, BTW, I swear)"
      },
      {
        "type": "p",
        "content": "Say goodbye and ask them to write their content themselves."
      },
      {
        "type": "h2",
        "content": "Checklist to Write SEO-Optimized Blog Post"
      },
      {
        "type": "p",
        "content": "✓) The Title Tag (H1) contains the main keyword. It is 60-70 characters long, clear, and compelling for both searchers and search engines."
      },
      {
        "type": "p",
        "content": "✓) The meta description should be 150-160 characters long, catchy, and compelling (so the reader clicks on the blog post). If it has a primary keyword, then the placement is natural."
      },
      {
        "type": "p",
        "content": "✓) The Introduction section has the best content angle that aligns with search intent. If it has a heading, then it is a meaningful phrase/sentence. It grabs attention, gives the readers a reason to read the blog, and tells them what to expect."
      },
      {
        "type": "p",
        "content": "✓) All the headers are complete, meaningful phrases or sentences. The heading hierarchy is correct (H1 → H2 → H3…). The headers have primary or secondary keywords or their variations or synonyms if possible."
      },
      {
        "type": "p",
        "content": "✓) Primary and secondary keywords are placed naturally throughout the blog post. Keyword density is 1-2%."
      },
      {
        "type": "p",
        "content": "✓) Content revolves around one idea and fulfills the search intent. It has original, unique, and valuable insights/perspectives."
      },
      {
        "type": "p",
        "content": "✓) The Content is readable and easy to understand for the targeted audience. The sentences are short and in the active voice (until the passive is necessary)."
      },
      {
        "type": "p",
        "content": "✓) The flow is smooth. There are no obvious grammatical and spelling errors."
      },
      {
        "type": "p",
        "content": "✓) The blog post has internal links (if the client demands them) and external links (if applicable)."
      },
      {
        "type": "p",
        "content": "✓) All the claims, reports, and studies mentioned in the content are authentic, and the resource link is provided at the end of the blog post section."
      },
      {
        "type": "p",
        "content": "✓) The images (if the blog post has) have descriptive ALT text."
      },
      {
        "type": "p",
        "content": "✓) The conclusion section has a clear CTA."
      },
      {
        "type": "p",
        "content": "NOTE:  This is the list that I follow while writing a blog post in ANY niche. But the list is not limited to only these 12 check points. For instance, if one of my clients has a certain tone, I will check that specific tone while writing."
      },
      {
        "type": "p",
        "content": "Unit 3:"
      }
    ]
  },
  "5": {
    "title": "The Blog’s Pre-Writing Phase",
    "sections": [
      {
        "type": "h1",
        "content": "The Blog’s Pre-Writing Phase"
      },
      {
        "type": "p",
        "content": "Suppose…"
      },
      {
        "type": "p",
        "content": "You are working with a client, who is in the middle of the two categories mentioned above. Your client is not impatient about the results. They don’t micromanage you. But they only give you a single phrase/primary keyword/topic to write."
      },
      {
        "type": "p",
        "content": "Let’s say…"
      },
      {
        "type": "p",
        "content": "It’s the “how to be more productive.”"
      },
      {
        "type": "p",
        "content": "Here is what you extracted from the chat with your client and their requirements;"
      },
      {
        "type": "p",
        "content": "(I’m just making everything up here…)"
      },
      {
        "type": "p",
        "content": "You were provided with the key phrase and these details and now it's your time to run the show."
      },
      {
        "type": "p",
        "content": "Side Note: Can you decide in which format and blog type this keyword will fall?"
      },
      {
        "type": "p",
        "content": "Yes? Good. You’re badass."
      },
      {
        "type": "p",
        "content": "Or…"
      },
      {
        "type": "p",
        "content": "Not yet? No worries…"
      },
      {
        "type": "p",
        "content": "Let’s get in…"
      },
      {
        "type": "p",
        "content": "Pro Tip: Use incognito mode while analyzing SERP or researching so that your previous activity or interaction with any page doesn't influence the SERP results."
      },
      {
        "type": "p",
        "content": "It's pretty much similar to how you start seeing ads about a particular thing on any of your socials when you talk about or search something a lot. Behavior does influence the activity."
      },
      {
        "type": "h2",
        "content": "Analyze the SERPs"
      },
      {
        "type": "p",
        "content": "Without hitting your head into anything else. Go to Google.  Simply copy & paste the exact keyword."
      },
      {
        "type": "p",
        "content": "Just like that…"
      },
      {
        "type": "p",
        "content": "Tip for You: Whenever I copy-paste the keyword… I behave like I know nothing…zero. No matter how many times I have written about the same topic."
      },
      {
        "type": "p",
        "content": "This way, I become curious about the subject. It gives me fresh eyes to look at everything and a blank mind to fill with information."
      },
      {
        "type": "p",
        "content": "I want you to do the same."
      },
      {
        "type": "p",
        "content": "Ignore the AI Overview (AIOs) content, but check what pages AI used to get content from. Visit them and note the parts which AI took to generate the answer."
      },
      {
        "type": "p",
        "content": "Then scroll down to the organically ranking content."
      },
      {
        "type": "p",
        "content": "But wait…."
      },
      {
        "type": "p",
        "content": "I see Google search filters for this topic.."
      },
      {
        "type": "p",
        "content": "These filters are helpful;"
      },
      {
        "type": "p",
        "content": "Our seed keyword or key phrase is “how to be more productive”"
      },
      {
        "type": "p",
        "content": "Based on these filters you can create following titles;"
      },
      {
        "type": "p",
        "content": "You see? Each one of these SEO titles has a different nature, purpose, and audience to serve."
      },
      {
        "type": "p",
        "content": "That’s where you need to circle back to your client and ask about their objective or purpose if they give you a generic key phrase like “how to be more productive.”"
      },
      {
        "type": "p",
        "content": "So, let say my client is a productivity coach and they have a tool which helps to manage to-do list. My client want me to talk about productivity + their tool."
      },
      {
        "type": "p",
        "content": "Here is the title that I will go with;"
      },
      {
        "type": "p",
        "content": "“How To Be More Productive & Finish your To-Do’s in Less Time”"
      },
      {
        "type": "p",
        "content": "(See how I cutiomized the title as per my client’s requirements…)."
      },
      {
        "type": "p",
        "content": "Now let’s get into SERP analysis."
      },
      {
        "type": "p",
        "content": "But what is SERP(s)?SERP is an acronym for Search Engine Ranking Page(s). The blogs/articles that search engines (Google) display on the first page after you enter a query. They typically have the first 10-11 blog posts/articles."
      },
      {
        "type": "p",
        "content": "You need SERP analysis to know what is already written on the topic. It helps you content gaps. You note the strengths and weaknesses of ranking content so you can do better and write more helpful content."
      },
      {
        "type": "p",
        "content": "On SERP;"
      },
      {
        "type": "p",
        "content": "You will analyze the Title and Meta Description."
      },
      {
        "type": "p",
        "content": "See how they used primary keywords in the title and MD (meta-description)."
      },
      {
        "type": "p",
        "content": "Is the title catchy? Did they mention the year? Is there any alternative to the keyword? Any supporting adjective(s)?"
      },
      {
        "type": "p",
        "content": "How is MD written? Is it informative or catchy? Full-sentence or just points/numbers?"
      },
      {
        "type": "p",
        "content": "(Note;  Not all clients demand a meta description. You, as a writer, should provide your client with a unique custom-written meta description. If you don’t, Google will select it from the blog post which is usually generic and does not satisfy the purpose)."
      },
      {
        "type": "p",
        "content": "I have analyzed the two below. You do it for at least 10."
      },
      {
        "type": "p",
        "content": "The ideal length of a title is 55-70 characters (8-10 words)."
      },
      {
        "type": "p",
        "content": "The ideal length of a Meta description is 120-140 characters."
      },
      {
        "type": "p",
        "content": "Writing a title or MD longer than the allowed space will not be visible to the readers. So, there is no point in writing more than what’s visible."
      },
      {
        "type": "p",
        "content": "You can preview meta-tags via the metatags(dot)io website."
      },
      {
        "type": "p",
        "content": "You have analyzed the SERP. Now is the time to analyze what’s in the 5 blogs."
      },
      {
        "type": "h3",
        "content": "Audit the Ranking Blogs."
      },
      {
        "type": "p",
        "content": "Open a blog post and notice the following:"
      },
      {
        "type": "p",
        "content": "Side note;"
      },
      {
        "type": "p",
        "content": "Heading hierarchy is the organization of headings and subheadings (H1, H2s…, etc.) in a blog. Usually, the blog starts with H1, followed by H2, and if you need more sub-sections, H3 can follow, and so on.You can audit a blog's heading hierarchy and structure manually or use a free Chrome extension. Simply download and add “Detailed SEO Extension.”Pin it. And while you’re in the blog, click the extension."
      },
      {
        "type": "p",
        "content": "Here is what you need to do;"
      },
      {
        "type": "p",
        "content": "You will repeat this operation to at least 5 blogs on the 1st page."
      },
      {
        "type": "p",
        "content": "After this, you will get to know;"
      },
      {
        "type": "p",
        "content": "Use a bit of your analytical powers, and notice the strengths and weaknesses of each blog. Why is the first ranking at first? What can be improved in 5th to bring it to the first place?"
      },
      {
        "type": "p",
        "content": "So, examine critically…and make notes."
      },
      {
        "type": "p",
        "content": "In the start…this process will take a lot of time…but with practice, it will only take some minutes."
      },
      {
        "type": "p",
        "content": "And remember….for now, you are just stalking the competitors and analyzing what’s ranking…NOT performing the research. That’s another phase (& we will get to it shortly)."
      },
      {
        "type": "p",
        "content": "The SERP analysis will help you to:"
      },
      {
        "type": "p",
        "content": "Ok, now tell me…"
      },
      {
        "type": "p",
        "content": "In which category and blog type our blog post “How To Be Productive and Get More Done in Less Time” will fall?"
      },
      {
        "type": "p",
        "content": "Yes…"
      },
      {
        "type": "p",
        "content": "And in the money-making blog type (most probably). This is the information you can get from your client as well."
      },
      {
        "type": "p",
        "content": "If your client is a productivity coach or maybe a SaaS founder (selling a productivity tool), then this blog post will fall under business blog type."
      },
      {
        "type": "p",
        "content": "But anyhow…"
      },
      {
        "type": "p",
        "content": "You see? One blog can overlap more than one type and category."
      },
      {
        "type": "p",
        "content": "And that’s where you need to decide the best title and “content angle”..."
      },
      {
        "type": "h3",
        "content": "Know the Searcher's Intent."
      },
      {
        "type": "p",
        "content": "You have been listening to and reading a lot about search intent (SI). Google cares a lot about it, and your blog depends on it."
      },
      {
        "type": "p",
        "content": "But what is search intent?"
      },
      {
        "type": "p",
        "content": "The searcher’s intent (reason, purpose, objective, etc)...which made them search something on Google is search intent."
      },
      {
        "type": "p",
        "content": "SO…."
      },
      {
        "type": "p",
        "content": "To determine the search intent, you need to answer;"
      },
      {
        "type": "p",
        "content": "The question is…"
      },
      {
        "type": "p",
        "content": "How do you get the answers for WHAT, WHO, WHY?"
      },
      {
        "type": "p",
        "content": "When you are an SEO writer…you are already given the WHAT."
      },
      {
        "type": "p",
        "content": "Which is simply the key phrase or the topic."
      },
      {
        "type": "p",
        "content": "You are left with WHO & WHY."
      },
      {
        "type": "p",
        "content": "WHO is the type of person performing the search…we also know them as our target audience or ideal customer/consumer or what I love to name as ideal reader."
      },
      {
        "type": "p",
        "content": "WHY is the specific reason a searcher is performing the search."
      },
      {
        "type": "p",
        "content": "WHY usually comes under these three categories:"
      },
      {
        "type": "p",
        "content": "Here is how you determine WHO and WHY (from existing content on Google);"
      },
      {
        "type": "p",
        "content": "Long tail keywords usually indicate who is searching. For example, the search intent for ‘How to be Productive and Get More Done in Less Time’ is obvious—the searcher wants to be more productive in their daily life routine. So,"
      },
      {
        "type": "p",
        "content": "WHO = a busy and overwhelmed person (male/female or even a student) juggling with loads of stuff."
      },
      {
        "type": "p",
        "content": "WHY = They have a huge list of to-dos so they want to get more done in less time."
      },
      {
        "type": "p",
        "content": "Another example…"
      },
      {
        "type": "p",
        "content": "‘best laptops for students under 40k’ is that searcher is a student looking for the best laptop under 40k."
      },
      {
        "type": "p",
        "content": "WHO = A student with tight budget"
      },
      {
        "type": "p",
        "content": "WHY = Looking for a laptop."
      },
      {
        "type": "p",
        "content": "See, it’s that much easy."
      },
      {
        "type": "p",
        "content": "More discussion on this is given below in ‘Types of search intent.’’"
      },
      {
        "type": "p",
        "content": "Content type means the ‘category’ or the subject of content—for instance, videos, podcasts, infographics, ebooks, or blogs. In our case, it’s already known—blogs."
      },
      {
        "type": "p",
        "content": "If videos on ranking on a certain query…that means people most like to watch videos on that specific topic."
      },
      {
        "type": "p",
        "content": "Similarly the type of format (listicles, how-tos, or case studies) tells you which format is most suitable."
      },
      {
        "type": "p",
        "content": "For instance, if listicles (like 5 ways to be more productive) are ranking that means people prefer to read listicles on that topic."
      },
      {
        "type": "p",
        "content": "If the majority of the ranking blog posts’ introduction start with facts and stats that means people are looking for stats and facts for that topic."
      },
      {
        "type": "p",
        "content": "These two sections on the first page tell you what other questions people have and what other related Kws or queries they are searching for."
      },
      {
        "type": "h3",
        "content": "From SEO Tools Like SEMrush or SEO.ai."
      },
      {
        "type": "p",
        "content": "Although, personally I am not a big fan of determining or evaluating search intent via SEO tools. Because I think search intent is purely a human phenomenon, and you as a human writer can better tell (or shall I say FEEL) your reader’s intent.  But anyway, folks use tools and I got to tell you."
      },
      {
        "type": "p",
        "content": "So, the first tool that I tried was SEMrush free version. Simply go to their Keyword Overview, put your key phrase and you will see the search intent. Just like that;"
      },
      {
        "type": "p",
        "content": "I know, I know, one word is just not enough to know, understand and feel the intent. But you get the anchor, right."
      },
      {
        "type": "p",
        "content": "The next tool which gives you something more than one word is SEO.ai."
      },
      {
        "type": "p",
        "content": "Go to this link. And type your keyword/query. It will give you some insights on what could be the search intent."
      },
      {
        "type": "p",
        "content": "The point is…."
      },
      {
        "type": "p",
        "content": "To find the intent of the searcher…you need to be an analyzer and observe more than a writer or researcher. Again…you will get better at this observation with time and practice."
      },
      {
        "type": "p",
        "content": "To better analyze the SI, you must know the types of search intent."
      },
      {
        "type": "p",
        "content": "Here we go…"
      },
      {
        "type": "h2",
        "content": "Types of Search Intent"
      },
      {
        "type": "p",
        "content": "I wanted to mention it before, ‘how to know search intent,’…. but that did not make any sense…as you can only ‘tag’ a name to search intent after knowing how to find the searcher’s intent."
      },
      {
        "type": "p",
        "content": "Anyway…here are some major types of search intent."
      },
      {
        "type": "p",
        "content": "(SI stands for ‘search intent’)."
      },
      {
        "type": "h3",
        "content": "Informational SI"
      },
      {
        "type": "p",
        "content": "This is the broadest SI… as people somehow are always looking for specific ‘information’. Even a single word like “laptop” can be an informational request."
      },
      {
        "type": "p",
        "content": "But…"
      },
      {
        "type": "p",
        "content": "Some informational' clues’, like ‘what’, ‘how’, and ‘where’, specifically refer to informational intent."
      },
      {
        "type": "p",
        "content": "Examples:"
      },
      {
        "type": "p",
        "content": "“How to increase productivity\""
      },
      {
        "type": "p",
        "content": "Or"
      },
      {
        "type": "p",
        "content": "\"Where can I find the best laptop in Pakistan?”"
      },
      {
        "type": "p",
        "content": "Side note;"
      },
      {
        "type": "p",
        "content": "This kind of content mostly falls under “TOFu” (top of the funnel) content, where the searcher wants to be ‘educated’ on something. This is the first stage…meaning that…if a brand has launched a productivity app and wants to start its blog to get organic traffic and get sign ups, they will start from here."
      },
      {
        "type": "p",
        "content": "So, think about it… you just launched a product/service. What do you need to get some eyeballs in the first place? Yes, awareness. You need to educate your target audience about how and why your product/service is special, what you do, how you do it, and who is the ideal user/customer. All is done in the TOFu funnel. And you need to satisfy informational search intent."
      },
      {
        "type": "h3",
        "content": "Preferential/Commercial SI"
      },
      {
        "type": "p",
        "content": "Some people prefer and like some brands over others; for instance, I like HP laptops more than Dell. And I like chaye over coffee. Bike over cars."
      },
      {
        "type": "p",
        "content": "So, a keyword like \"best productivity apps” will infer preferential search intent."
      },
      {
        "type": "p",
        "content": "Similarly, if someone is looking for comparisons like “Zappier vs. Trello,” reviews like “Trello app reviews,” or investigations like “Why zapier is better than trello”, etc. falls under commercial intent."
      },
      {
        "type": "p",
        "content": "Side note;"
      },
      {
        "type": "p",
        "content": "At this point, the reader is past the informational stage (they are not looking for information and don’t want any educational stuff). This is MOFu (Middle of the funnel) content."
      },
      {
        "type": "p",
        "content": "(the searcher is investigating something)."
      },
      {
        "type": "p",
        "content": "When you are done educating and spreading awareness and your ideal customers or consumer know about your product and services the next thing they do is to investigate further about your product/service."
      },
      {
        "type": "p",
        "content": "Other Examples for commercial SI:"
      },
      {
        "type": "h3",
        "content": "Transactional SI"
      },
      {
        "type": "p",
        "content": "Now, the searcher wants to make a purchase. They are looking for a specific product or service. Now, this specific (i.e., purchasing stuff) intent often involves a service or product…"
      },
      {
        "type": "p",
        "content": "But transactional search intent is not limited to services or products."
      },
      {
        "type": "p",
        "content": "In other words, this search intent involves any “action” to be completed (so the action verb will denote transaction SI), such as ‘buying’, ‘downloading’, ‘booking’, ‘subscribing’, ‘signing up’, ‘scheduling’, etc."
      },
      {
        "type": "p",
        "content": "Examples: “Buy HP laptop online\" or \"Sign up for a newsletter” or “Zapier Login”"
      },
      {
        "type": "h3",
        "content": "Navigational SI"
      },
      {
        "type": "p",
        "content": "This search intent refers to a specific location/place/website. “Specific” is an important word here….when a searcher specifically navigates something….they know what they are doing….where they’ll find their stuff…"
      },
      {
        "type": "p",
        "content": "For instance, “HP laptop at Daraz under $300.”"
      },
      {
        "type": "p",
        "content": "The contact page, homepage, and log-in to any app or site…all indicate a navigational search intent."
      },
      {
        "type": "p",
        "content": "Examples: “Facebook login\" or \"HP official website homepage.” etc."
      },
      {
        "type": "p",
        "content": "And one more thing…."
      },
      {
        "type": "p",
        "content": "Long-tail keywords better tell you search intent."
      },
      {
        "type": "p",
        "content": "Ohhh….shall we have a look at the types of keywords?"
      },
      {
        "type": "h2",
        "content": "Types of Keywords You Must Know as a Writer."
      },
      {
        "type": "p",
        "content": "There are one—or two-word phrases. They are broad and general (and popular, sometimes). Non-specific. They have a high search volume and high competition."
      },
      {
        "type": "p",
        "content": "Examples:"
      },
      {
        "type": "p",
        "content": "“Laptop”, “HP Laptop”, “Gaming Laptop” “Pizza”, “Pizza Restaurant”"
      },
      {
        "type": "p",
        "content": "Etc."
      },
      {
        "type": "p",
        "content": "You see, the search intent could be anything here, from informational to transactional."
      },
      {
        "type": "p",
        "content": "So, we can’t rely on a short-tail keyword to analyze SERPs or find search intent. We gotta dig deep…"
      },
      {
        "type": "p",
        "content": "These are Longer phrases with three to five (or more) words. They are specific and targeted, with low search volume and low competition. These keywords tell us more specifically about search intent."
      },
      {
        "type": "p",
        "content": "Examples:"
      },
      {
        "type": "p",
        "content": "\"Best-budget laptops for content writers\""
      },
      {
        "type": "p",
        "content": "Here are search intent clues from this long-tail keyword/phrase:"
      },
      {
        "type": "p",
        "content": "I can go on and on….but you get the idea."
      },
      {
        "type": "p",
        "content": "Now, as we are talking about keyword types…I shall mention some other popular terms, too."
      },
      {
        "type": "p",
        "content": "Just stick with me for a moment."
      },
      {
        "type": "p",
        "content": "I know you have a lot to do today…but believe me, you won’t regret the time spent on this guide."
      },
      {
        "type": "p",
        "content": "Keywords that include a brand name or variation of a brand name or a product name. These are the queries directly ‘associated’ with a brand or product."
      },
      {
        "type": "p",
        "content": "Examples:"
      },
      {
        "type": "p",
        "content": "\"Dell best-budget laptop\" and \"Nike running shoes.\""
      },
      {
        "type": "p",
        "content": "Branded keywords often have navigational search intent."
      },
      {
        "type": "h3",
        "content": "Primary or Seed keywords Vs. Secondary Keywords Vs. LSI"
      },
      {
        "type": "p",
        "content": "Primary and seed keywords are also known as ‘head keywords’."
      },
      {
        "type": "p",
        "content": "They are the starting point of keyword research. You can also call them ‘main terms’ or broader terms that a target audience searches for…"
      },
      {
        "type": "p",
        "content": "So, in this sense, you can also tag primary/seed/head keywords as ‘short-tail keywords’."
      },
      {
        "type": "p",
        "content": "Note: You don’t need any tool to find seed or head keywords. It’s just simply the business of your clients…or you brainstorm them. And being an SEO writer, you’re most of the time provided with a primary or seed keyword."
      },
      {
        "type": "p",
        "content": "Example:"
      },
      {
        "type": "p",
        "content": "Let's say your client sells laptops online. They will let you know what type of laptops they sell…HP, Dell, Lenovo, Acer, Apple, etc. So, primary keywords will be like ‘HP Laptops, ‘Lenovo Laptops’ etc."
      },
      {
        "type": "p",
        "content": "Secondary keywords are ‘closely’ related terms to primary keywords."
      },
      {
        "type": "p",
        "content": "They support primary keywords. They add specific details. So, secondary keywords are also tagged as “long-tail keywords”."
      },
      {
        "type": "p",
        "content": "Note: You, as a writer, can find secondary keywords using any free tool like Google Keywords Planner or free versions of SEMrush or Ahrefs. You can also find them through SERP analysis by looking at Google auto search bar suggestions, PAA box, and related searches (this is my fave practice). And sometimes ... you will get a list of secondary keywords from your client as well (remember, all-knowing one?)"
      },
      {
        "type": "p",
        "content": "Example:"
      },
      {
        "type": "p",
        "content": "‘HP laptops for gamers’,"
      },
      {
        "type": "p",
        "content": "‘best laptops for video editing’, etc."
      },
      {
        "type": "p",
        "content": "LSI (Latent Semantic Indexes) keywords: When you publish a blog…it has a specific topic in a specific category. It discusses a specific issue and provides a specific solution…."
      },
      {
        "type": "p",
        "content": "In simplest words, if your blog is about laptops…you will not discuss mobiles. If your blog is in the automotive niche, you will be focused on vehicles…and not touch health issues."
      },
      {
        "type": "p",
        "content": "Ok, let’s put it in other words…Latent means ‘hidden’, non-obvious. Semantic is the meaning of a term (other related words/attributes/characteristics of a word). So, latent semantics are the hidden or non-obvious words or terms for a specific word. Indexing (in this context) is used for retrieving information (or gathering relevant information around a specific topic)."
      },
      {
        "type": "p",
        "content": "Latent semantic indexing (basically a term in NLP (natural language processing) is a method that classifies words based on their surroundings or context. As you know, one word has different meanings in different contexts."
      },
      {
        "type": "p",
        "content": "Well…what’s the purpose of LSI in your blog?"
      },
      {
        "type": "p",
        "content": "When you publish your content online, the search engine (Google in our case) considers related terms to understand your content…and match the overall text with ‘search intent’."
      },
      {
        "type": "p",
        "content": "It helps search engines understand the ‘relevancy’ of content."
      },
      {
        "type": "p",
        "content": "In other words…LSI creates an overall ‘environment’ that helps search engines deeply understand specific content."
      },
      {
        "type": "p",
        "content": "Note: LSI and synonyms are not the same thing. Synonyms are part of LSI terms…but not necessarily the synonym of a keyword."
      },
      {
        "type": "p",
        "content": "For instance…the synonyms for laptop are palmtop, minicomputer, or microcomputer. But the LSI terms (that goes along with laptop) are storage, performance, RAM/ROM, gaming, editing…or some parts of a laptop like display, keyboard, touchpad, etc."
      },
      {
        "type": "p",
        "content": "Another silly & non-related example (which our linguistic professor used to give us) is"
      },
      {
        "type": "p",
        "content": "Needle…needle is semantically related to pain, threading, sewing, etc."
      },
      {
        "type": "h3",
        "content": "How to find LSI keywords?"
      },
      {
        "type": "p",
        "content": "Having a list of related terms helps you cover your blog better and helps Google understand your content more deeply."
      },
      {
        "type": "p",
        "content": "But where to find them?"
      },
      {
        "type": "p",
        "content": "The best tool is your mind, of course."
      },
      {
        "type": "p",
        "content": "Now, you might be thinking…"
      },
      {
        "type": "p",
        "content": "Do I have to have a whole list of LSI with me while writing the blog? NO."
      },
      {
        "type": "p",
        "content": "You don’t need to cover everything in the LSI list of a specific keyword. Only focus on 4-5 most relevant LSI terms. For instance…in ‘best budget laptop’, the most relevant LSI term would be pricing, laptop performance (speed, battery, display, camera, etc.), and usage (gaming, editing, writing, etc.)."
      },
      {
        "type": "p",
        "content": "There are some tools, too, that can help you with LSI terms."
      },
      {
        "type": "p",
        "content": "Just type “LSI keywords generator free” on Google. I mostly use Twinword. And sometimes AnswerThePublic."
      },
      {
        "type": "p",
        "content": "Note down the most relevant/trending LSI and then naturally use them in your blog."
      },
      {
        "type": "h2",
        "content": "Research the Topic Like a Pro"
      },
      {
        "type": "p",
        "content": "With all the previous knowledge in mind, let’s focus on only one goal….how to research a topic that covers everything, fulfills search intent, and is EEAT-aligned."
      },
      {
        "type": "p",
        "content": "(We are going to repeat some previous stuff in an organized way)"
      },
      {
        "type": "p",
        "content": "As you know first of all, you need to perform SERP analysis for the primary phrase or keyword."
      },
      {
        "type": "h3",
        "content": "Don’t Rely on Just One SERP"
      },
      {
        "type": "p",
        "content": "Use different variations of the primary keyword."
      },
      {
        "type": "p",
        "content": "Something that we did while doing the SERP analysis in unit 2."
      },
      {
        "type": "p",
        "content": "The key phrase is “how to be productive.”"
      },
      {
        "type": "p",
        "content": "Here are the variations;"
      },
      {
        "type": "p",
        "content": "Variation 1 = Tricks to be more productive"
      },
      {
        "type": "p",
        "content": "Variation 2 = Practical ways to be productive"
      },
      {
        "type": "p",
        "content": "Variation 3 = How to be productive at work"
      },
      {
        "type": "p",
        "content": "Variation 4 = how to double productivity"
      },
      {
        "type": "p",
        "content": "Here is another example for you. The key phrase is “best budget laptops”"
      },
      {
        "type": "p",
        "content": "Variation 1 = Affordable laptops"
      },
      {
        "type": "p",
        "content": "Variation 2 = Best laptops under $500"
      },
      {
        "type": "p",
        "content": "Variation 3 = Best budget laptops 2024"
      },
      {
        "type": "p",
        "content": "Variation 4 = Best budget Windows laptops"
      },
      {
        "type": "p",
        "content": "Now you have 4 variants of almost similar query."
      },
      {
        "type": "p",
        "content": "You can brainstorm these variations. Or you can use the SEMrush magic keywords tool (it’s free)."
      },
      {
        "type": "p",
        "content": "Dump your unique findings and most valuable information in a Google doc (or in your notebook if you like)"
      },
      {
        "type": "p",
        "content": "My Notes for ‘how to be productive’"
      },
      {
        "type": "p",
        "content": "I love to use my notebook…while analyzing the SERPs….now I usually only write what’s missing in the blogs like for “how to be more predictive” I saw that;"
      },
      {
        "type": "h3",
        "content": "Try different versions/variaton of your EXACT SEO title in SERP…"
      },
      {
        "type": "p",
        "content": "Remember the topic we selected? How To Be More Productive & Finish your To-Dos in Less Time."
      },
      {
        "type": "p",
        "content": "First; put that exact title in SERP…you will see that the SERP result is slightly change than “how to be more productive” seed keyword and there are some new blog posts ranking on the first page. WHY?"
      },
      {
        "type": "p",
        "content": "Because “finish your to-do’s” changed the search intent. And it could be a key phrase in itself too…like “How to finish To-do’s in Less Time”."
      },
      {
        "type": "p",
        "content": "Second; put that second keyphrase in SERP “how to finish to-dos in less time”, you will see totally different SERP result. Spend some mins reading 2-3 blogs for this one and note information or perspectives that you can use in your blog post."
      },
      {
        "type": "p",
        "content": "Third; try different version of “how to be more productive”...like “how to do more work in less time”, or “how to work fast”, or “how to increase productivity”......and so on."
      },
      {
        "type": "p",
        "content": "That means…"
      },
      {
        "type": "p",
        "content": "You can play with your exact SEO title and use it’s different parts to run a SERP analysis. This will not be applicable everytime, but you should know the trick. Just think outside of the box and play around your exact SEO title."
      },
      {
        "type": "h3",
        "content": "Go to Social Sites Like Quora and Reddit."
      },
      {
        "type": "p",
        "content": "Type your query. Set the time filter to the past month or past year. Read the top 4- 5 relevant answers. You will get real user insights."
      },
      {
        "type": "p",
        "content": "You will also find questions for which people want answers. Social sites are the best places to find these questions because real people are asking them."
      },
      {
        "type": "p",
        "content": "Quora;"
      },
      {
        "type": "p",
        "content": "Interesting questions and concepts  that I found from Qoura;"
      },
      {
        "type": "p",
        "content": "Questions;"
      },
      {
        "type": "p",
        "content": "You see, questions like these broaden my perspectives and give me new angle to think about. I don’t necessarily need to create a section (or H2) for each question, I can answer these questions where they logically make sense in the blog."
      },
      {
        "type": "p",
        "content": "Concepts & Ideas;"
      },
      {
        "type": "p",
        "content": "When I was reading the answers, I found these interesting concepts that many blog posts did not touch;"
      },
      {
        "type": "p",
        "content": "If I find an interesting concept, I’d dig deep into it. And then all of those unique concepts and pointers help me write better. The point is to get ‘practical’ but ‘non-obvious’ information. For instance, prioritize important tasks is an obvious tip but shallow and deep work is not that much obvious."
      },
      {
        "type": "p",
        "content": "Reddit;"
      },
      {
        "type": "p",
        "content": "Same operation. Find interesting questions. Read the popular answers and find unique concepts."
      },
      {
        "type": "p",
        "content": "Questions;"
      },
      {
        "type": "p",
        "content": "Ideas & concepts"
      },
      {
        "type": "p",
        "content": "Reddit is also the best place when you want to add a bit of native humor, etc. It’s just like people are debating on a topic. And you find the good stuff from that debate."
      },
      {
        "type": "p",
        "content": "PS. Sometimes, I use social media sites like LinkedIn and Instagram to know what people (especially subject matter experts (SMEs) say. But only when I feel/know that I can get data from social media for a specific topic."
      },
      {
        "type": "h3",
        "content": "Find the Content Gap as Per Search Intent."
      },
      {
        "type": "p",
        "content": "Content gap means what others have not covered…or covered less effectively."
      },
      {
        "type": "p",
        "content": "You will find many ranking pages that are missing something… that you can do better. For instance the other day I was writing on best-budget laptops and saw that some ranking blogs were missing battery performance points. This is an important point…as the reader wants to know the timing and performance of the battery."
      },
      {
        "type": "p",
        "content": "In our topic, how to be more productive, as we saw that some blogs are not talking about exercise or workout…some are missing “habits”, etc."
      },
      {
        "type": "p",
        "content": "There was less talk about morning routines, sleep patterns, etc."
      },
      {
        "type": "p",
        "content": "All of this is the content gap."
      },
      {
        "type": "p",
        "content": "For you I can break it down in;"
      },
      {
        "type": "p",
        "content": "There is no guessing in deciding the content gap. Sure, your exposure to a topic might come in handy, but you don’t have exposure every time with every topic. So, how will you find the content gap?"
      },
      {
        "type": "p",
        "content": "Remember keyphrase variation? When you look at the data of 3-4 SERPs, you will notice that ranking blogs share some common points, but they also have some of their unique points. Note both. Now look at your key phrase and think about what possibly be the purpose of a searcher… or even better, what YOU would like to read in the blog if you were the searcher... but is not written properly in the ranking blogs."
      },
      {
        "type": "p",
        "content": "Pick that point and make it your strength. The central focus of your blog. The well-written blogs are purpose-oriented. They focus on one focal point and describe it fully."
      },
      {
        "type": "h3",
        "content": "Find SMEs Quotes or Official (& credible) Resources for Facts/Stats."
      },
      {
        "type": "p",
        "content": "For almost any kind of topic there is one subject matter expert (SME) person. For instance in our case, you can try to reach out to any productivity coach and ask them some questions like how they manage their time and what they do to be more productive, etc. Note that “quote” does not just mean those “golden sayings”, SMEs’ quotes means the experiences and point of view of an expert on a specific topic. You can get that point of view from a friend or family member, too. But they won’t be subject matter experts. SME is someone who has first hand market knowledge of a specific topic. You can find them on social media (LinkedIn, Instagram or Facebook)."
      },
      {
        "type": "p",
        "content": "To find stats and facts about topics, you can try these sites;"
      },
      {
        "type": "p",
        "content": "It gives you insights and facts across 170 industries and 150+ countries."
      },
      {
        "type": "p",
        "content": "It helps you find original sources here and tell a better story."
      },
      {
        "type": "p",
        "content": "Qwoted"
      },
      {
        "type": "p",
        "content": "And yes you can use golden sayings in your blog post too, no issue. But don’t use them excessively and only use where they make sense."
      },
      {
        "type": "p",
        "content": "Important"
      },
      {
        "type": "p",
        "content": "NOTE: Writing a blog post which is filled with SMEs quotes (POV, experiences, etc.) is also a totally different thing and specially applicable when you are a niche SEO blog writer. SMEs charge for their time and in this sense your client knows that they have to pay for SMEs interviews. You can further dig into this topic by researching it on Google."
      },
      {
        "type": "p",
        "content": "Important"
      },
      {
        "type": "p",
        "content": "You can find the latest news and publications in credible blogs and magazines about a topic if you search it in Google News."
      },
      {
        "type": "p",
        "content": "Google Scholar has research studies for almost ANY topic in the world."
      },
      {
        "type": "p",
        "content": "If you want to include some facts and stats, then Google Scholar is the best place."
      },
      {
        "type": "h2",
        "content": "Homework for Newbies:"
      },
      {
        "type": "p",
        "content": "Unit 4:"
      }
    ]
  },
  "6": {
    "title": "Let's Start Writing",
    "sections": [
      {
        "type": "h1",
        "content": "Let's Start Writing"
      },
      {
        "type": "p",
        "content": "Now is the time to wake the writer inside you. Now is the time to showcase how better, and effectively you can use whatever information you stacked while researching and analyzing the topic."
      },
      {
        "type": "p",
        "content": "So, let's get into it…"
      },
      {
        "type": "h2",
        "content": "Create Outlines"
      },
      {
        "type": "p",
        "content": "Yes, obviously. This is the first step and the most important one that makes or breaks your blog post."
      },
      {
        "type": "p",
        "content": "Keep in mind these “rule of thumbs” while creating the outlines;"
      },
      {
        "type": "p",
        "content": "You can’t start writing without having proper outlines."
      },
      {
        "type": "p",
        "content": "I usually work on outlines in two phases."
      },
      {
        "type": "p",
        "content": "First, I focus on main headings and subheadings."
      },
      {
        "type": "p",
        "content": "Second, I fill my main headings and subheadings with further points that I want to discuss."
      },
      {
        "type": "p",
        "content": "In any blog post, there are three sections;"
      },
      {
        "type": "p",
        "content": "Introduction section has two purposes;"
      },
      {
        "type": "p",
        "content": "Body section also has only one purpose; deliver on the promise you made in your introduction section."
      },
      {
        "type": "p",
        "content": "You do this by;"
      },
      {
        "type": "p",
        "content": "Conclusion section has two purposes;"
      },
      {
        "type": "p",
        "content": "Let me show you how I will write outlines for our topic “How To Be More Productive & Finish Your To-Do’s in Less Time”."
      },
      {
        "type": "p",
        "content": "First phase;"
      },
      {
        "type": "p",
        "content": "<H2> (Introduction section): Being Busy Doesn't Mean You’re Being Productive"
      },
      {
        "type": "p",
        "content": "<H2> (Body Section); 5 Ways To Be More Productive and Get Your To-Dos Done In Less Time"
      },
      {
        "type": "p",
        "content": "<H3> Tune Out All Distraction And Get Your “Workstation” Ready"
      },
      {
        "type": "p",
        "content": "<H3> Make A To-Do List On Priority Basis"
      },
      {
        "type": "p",
        "content": "<H3> Make Your Most Important Daily Task Your HABIT"
      },
      {
        "type": "p",
        "content": "<H3> Implement Pomodoro Technique and Time Blocks Methods"
      },
      {
        "type": "p",
        "content": "<H3> Focus on Getting Things done Instead of Perfection"
      },
      {
        "type": "p",
        "content": "<H2> (Conclusion section): You have all what it takes to be more productive"
      },
      {
        "type": "p",
        "content": "Second phase;"
      },
      {
        "type": "p",
        "content": "<H2> (Introduction section); Being busy doesn't mean you’re being productive"
      },
      {
        "type": "p",
        "content": "<H2> (Body Section); 5 ways to be more productive and get your to-dos done in less time"
      },
      {
        "type": "p",
        "content": "<H3> Tune out all distractions and get your “workstation” ready"
      },
      {
        "type": "p",
        "content": "<H3> Make a  To-Do List on Priority Baisis"
      },
      {
        "type": "p",
        "content": "<H3> Make Your Most Important Daily Task Your Habit"
      },
      {
        "type": "p",
        "content": "<H3> Implement Pomodoro Technique and Time Blocks Methods"
      },
      {
        "type": "p",
        "content": "<H3> Focus on Getting Things done Instead of Perfection"
      },
      {
        "type": "p",
        "content": "<H2> You Have all What it Takes to be More Productive"
      },
      {
        "type": "p",
        "content": "So, here is what I did;"
      },
      {
        "type": "p",
        "content": "In the first phase, I wrote the main headings. Those headings contain the content gap and all the noval ideas that I found during my research."
      },
      {
        "type": "p",
        "content": "In the second phase, I wrote the subpoints for each heading that I need to discuss."
      },
      {
        "type": "p",
        "content": "In the third phase, I will expand on those subpoints a bit."
      },
      {
        "type": "p",
        "content": "Now here is how I further dig into research;"
      },
      {
        "type": "p",
        "content": "While expanding on the main headings, usually I run a search for the heading separately too. For instance, my first H3 is “Tune Out All Distractions…”, I’ll go to Google and search for “how to remove distractions while working”. It gives me further ideas that I can include in my subpoints."
      },
      {
        "type": "p",
        "content": "Then for each subpoint I do the same. For instance in the second H3, a subpoint is “balance between creating & consuming”, I will go to Google and search for the same point."
      },
      {
        "type": "p",
        "content": "That’s how I dig that rabbit hole and it help me get bunch of perspective and unique points to discuss."
      },
      {
        "type": "p",
        "content": "This is what I call “secondary research”."
      },
      {
        "type": "p",
        "content": "But secondary research has its own drawback for a newbie…"
      },
      {
        "type": "p",
        "content": "So…as long as you can stick to the main point and make your piece entirely helpful with valuable information, dig as deep as you can. If not, the primary research (that you did for the overall topic) is enough."
      },
      {
        "type": "h3",
        "content": "Make a logical flow between the headings and subheadings"
      },
      {
        "type": "p",
        "content": "This is one of the MOST important consideration while writing outlines. It’s a line between mediocre content and premium content."
      },
      {
        "type": "p",
        "content": "What is logical flow and how to do it? I’ll tell you exactly but first let’s understand what is disruptive flow and why it’s a bad thing."
      },
      {
        "type": "p",
        "content": "When you’re randomly jumping from 1 information to the next it is called disruptive flow."
      },
      {
        "type": "p",
        "content": "For example, let's say I am writing a blog post on;"
      },
      {
        "type": "p",
        "content": "“3 Tips for Healthy Weight Loss”. And my headings go like this;"
      },
      {
        "type": "p",
        "content": "<H2> Eat More Veggies"
      },
      {
        "type": "p",
        "content": "<H2> Sleep More"
      },
      {
        "type": "p",
        "content": "<H2> Cut Out Sugary Drinks"
      },
      {
        "type": "p",
        "content": "I know these outlines are NOT “wrong”."
      },
      {
        "type": "p",
        "content": "But tell me, is there any logical connection between ‘eating more veggies’ and then ‘sleeping more’ and then instantly telling your readers that they need to cut out sugary drinks? No. And the consequences?"
      },
      {
        "type": "p",
        "content": "Readers get confused, they lose interest and they leave. It shows your bogosity and gives the impression that you, as a writer, don't have command over concepts."
      },
      {
        "type": "p",
        "content": "Here is the refined version;"
      },
      {
        "type": "p",
        "content": "<H2> Set Practical Health Goals"
      },
      {
        "type": "p",
        "content": "<H2> Include Veggies in Your Diet"
      },
      {
        "type": "p",
        "content": "<H2> Choose Water Over Sugary Drink"
      },
      {
        "type": "p",
        "content": "Here is the flow…"
      },
      {
        "type": "p",
        "content": "Ok, now let’s see how our outlines for ““How To Be More Productive & Finish Your To-Do’s in Less Time” have logical flow."
      },
      {
        "type": "p",
        "content": "You see..?"
      },
      {
        "type": "p",
        "content": "Each heading is complementing its precursor and preceder."
      },
      {
        "type": "p",
        "content": "This logical flow is also called “Content Coherance”."
      },
      {
        "type": "p",
        "content": "When from start (intro section) to end (conclusion section) your piece is well “knitted: and has a logical flow, it’s a coherent content."
      },
      {
        "type": "p",
        "content": "There are two levels of coherence;"
      },
      {
        "type": "p",
        "content": "It’s a connection between words and sentences at a textual level. In other words, the meaning of each sentence should flow naturally into the next."
      },
      {
        "type": "p",
        "content": "For example, if you're discussing \"tuning out distractions,\" the following sentence should expand on that idea, like \"start by silencing notifications.\""
      },
      {
        "type": "p",
        "content": "Here’s how;"
      },
      {
        "type": "p",
        "content": "Remove all distractions from your workspace. Begin by silencing notifications on your phone, then lock it away in a drawer. Clear your desk of any unnecessary items and leave only the essentials needed for your work. This will help you maintain focus and productivity."
      },
      {
        "type": "p",
        "content": "Here is the semantically incoherent version;"
      },
      {
        "type": "p",
        "content": "First, remove all distractions. Then, lock your phone in a drawer and grab a coffee. It’s important to keep your workspace organized. Keep a plant on your desk, it might help you feel more relaxed during work."
      },
      {
        "type": "p",
        "content": "Which version made more sense?"
      },
      {
        "type": "p",
        "content": "The first one. Why? Because all three out of four sentences were “semantically” connected with the idea of “remove all distractions”...the first sentence."
      },
      {
        "type": "p",
        "content": "It refers to how well one concept leads into the next. And when you complete a “section”, all the ideas discussed in it makes an overall logical sense. For instance, you’re writing a blog post about productivity, and you discussed 5 practical tactics to be more productive in it, at the end of the 5th tactic, all the 5 should make a logical sense.  Each tactic should naturally build upon the previous one (and then leads to the next one naturally). It brings clarity and flow."
      },
      {
        "type": "p",
        "content": "Go back to the outlines that I wrote and observe conceptual coherence in them."
      },
      {
        "type": "p",
        "content": "The question is…."
      },
      {
        "type": "p",
        "content": "How do you get the coherecny in your content?"
      },
      {
        "type": "p",
        "content": "These four pointers always help me write a coherent content;"
      },
      {
        "type": "p",
        "content": "In other words, it’s the objective or purpose of writing your blog post. Can you explain it in 1 or maximum two sentences? If yes, then all good. If no, then you need a bit more research and clarity."
      },
      {
        "type": "p",
        "content": "Does your blog post has the “transformative power”? Is it something that can drive readers from one point in their lives to the next point?"
      },
      {
        "type": "p",
        "content": "From problem to solution. From being non-knowledgeable to knowledgeable. From being stuck to unstuck."
      },
      {
        "type": "p",
        "content": "If you are talking about productivity…talk about productivity throughout the blog post. Don’t discuss health or wealth. Stick to your main idea and everything will flow."
      },
      {
        "type": "p",
        "content": "This happens when you indulge yourself in in-depth research and then get several ideas about a topic and then try to cover everything in the blog post. It destroy the flow and distract you from the main idea. But the thing is…you don’t have any option other than indulging in deep research."
      },
      {
        "type": "p",
        "content": "For instance, while researching for productivity, you will find many techniques and strategies to improve productivity but not all of them will make perfect sense to each other."
      },
      {
        "type": "p",
        "content": "So, at this point you should know what to include and what to leave. It takes time…but with practice you get better."
      },
      {
        "type": "p",
        "content": "If you are writing a blog post on “how to be more productive”, then don’t DEFINE productivity….and don’t talk about it’s benefits. Just focus on the ways that can help your readers become more productive."
      },
      {
        "type": "p",
        "content": "Similarly, don’t miss necessary information. The information that is MUST to fulfil the search intent. I call it key content of the blog post."
      },
      {
        "type": "p",
        "content": "Tips for Making your Outlines Unique & Catchy"
      },
      {
        "type": "p",
        "content": "Don’t write what is obvious  – What reader already knows. This becomes a bit tricky when you don’t know your reader ( and that’s where “know your audience” actually comes in play). When you know your reader, you know what they already know and what is “new” for them."
      },
      {
        "type": "p",
        "content": "So, you need to present a “novel” idea/prespective/point of view."
      },
      {
        "type": "p",
        "content": "Here are some of my tried and tested ways to do so;"
      },
      {
        "type": "p",
        "content": "DON’T USE ChatGPT for creating outlines from scratch especially if you’re a newbie."
      },
      {
        "type": "p",
        "content": "Whenever I ask a junior writer that how they use ChatGPT for their blog posts…I get almost the same answer that they use if for outlines and “ideas”."
      },
      {
        "type": "p",
        "content": "Which is really a weak practice."
      },
      {
        "type": "p",
        "content": "If you are a newbie, FORGET ChatGPT, do your research and idea generation and write outlines manually."
      },
      {
        "type": "p",
        "content": "Why am I saying that?"
      },
      {
        "type": "p",
        "content": "Because when, as a newbie, you start relying on ChatGPT (or any AI tool) to research and write outlines, your skill never get polished. You never get to know the original process. And you will never know the difference between “good” and “bad” outlines."
      },
      {
        "type": "p",
        "content": "This is not just for research and outlines , you should not use it for writing as well."
      },
      {
        "type": "p",
        "content": "Why?"
      },
      {
        "type": "p",
        "content": "Because AI tools’ dependency never lets you develop your style. I’ve seen AI tools making newbie writers dumb & dull."
      },
      {
        "type": "p",
        "content": "You don’t need to churn 2000+ words every day. You don’t need a 100% gramatical  “accurate” content piece. You need a blog post that people actually read and get any kind of value from it."
      },
      {
        "type": "p",
        "content": "You need words that connect and make people feel and act. You need a voice through words that reach hearts."
      },
      {
        "type": "p",
        "content": "And you can NEVER achieve this if you don’t know the “craft”."
      },
      {
        "type": "p",
        "content": "I present an analogy here; you can have all the equipments a carpenter use, but will not be able to build a building until you know how to use those equipments and unless you have had spent time “learning” how to build buildings."
      },
      {
        "type": "p",
        "content": "ChatGPT or any AI tool is just that equipment."
      },
      {
        "type": "p",
        "content": "I can go on and on but what I really want to say is that, declare ChatGPT as your RED ZONE.  And Never enter into it. Never open it until you know…. your skill has been matured enough that no AI can impact it."
      },
      {
        "type": "p",
        "content": "The other major drawback is that ChatGPT’s content is generic and repetitive which fail to make any real difference. This repetition occurs on so many levels. Let’s understand this;"
      },
      {
        "type": "p",
        "content": "You want to write a blog post and don’t know about the topic, you have no prior research and does not know the search intent of the searcher. In this sense, you will write a generic prompt without any specific details. ChatGPT will come up with generic outlines and those generic outlines will lead to generic outlines and repetitive information."
      },
      {
        "type": "p",
        "content": "Let’s say you a lifestyle blog writer, and often write for clothing brands. And you are working for two different clients, but rely on ChatGPT to write your content. You will never be able to differentiate the tone and style between the two. Content will sounds like a duplicate of each other."
      },
      {
        "type": "p",
        "content": "Let's say, you and another writer are writing on a same topic….and you’ve both given ChatGPT a general prompt to write the outlines. It will 90% write the same outlines and after that you will get 90% the same content."
      },
      {
        "type": "p",
        "content": "Think it in a bigger picture. If this is what every other blog writer is doing, the time is not that far when all we have on Google will be AI cluttered content. We are already going through content shock. Please don’t make people hate blogs:)."
      },
      {
        "type": "p",
        "content": "So, when is the best time to use or get help from ChatGPT?"
      },
      {
        "type": "p",
        "content": "When your writing tone and research skills are matured enough that AI can’t effect it and you have been working hard on the the craft to polish your tone and style, then you can freely use AI. It may take 6 months or 6 years, but stick to it."
      },
      {
        "type": "p",
        "content": "Because at that time you will exactly know the difference  between good and bad writing."
      },
      {
        "type": "p",
        "content": "You will be able to edit/tweak/modify AI writing as per your tone and style. You will know what words are not the best choice and what to choose instead. And at that time you will also be able to write “custom” prompts and you will exactly know how to edit and refine AI content to infuse a life in your words."
      },
      {
        "type": "h2",
        "content": "Ranking Blog Audits"
      },
      {
        "type": "p",
        "content": "Instead of me writing a whole new blog post, I decided to audit already ranking blog posts for our selected topic ‘How to be more productive’."
      },
      {
        "type": "p",
        "content": "Because this way I can better tell you what’s possibly working, as the blog posts are already ranking."
      },
      {
        "type": "p",
        "content": "Let’s audit the ranking blog posts for our selected topic."
      },
      {
        "type": "h3",
        "content": "Blog Post 1: 18 Habits of Highly Productive People: What Efficient People Have in Common"
      },
      {
        "type": "h4",
        "content": "Title"
      },
      {
        "type": "p",
        "content": "“18 Habits of Highly Productive People: What Efficient People Have in Common”"
      },
      {
        "type": "p",
        "content": "Although the title exceeds the visible character count limit (which is 55-65 characters), it’s clear and catchy."
      },
      {
        "type": "p",
        "content": "Clear as the readers know exactly what they will get: a list of habits that productive people share."
      },
      {
        "type": "p",
        "content": "It's catchy (to me) because of phrases like ‘highly productive people’ and ‘efficient people have in common.’ These two phrases hit my desire to be highly productive and efficient. Also, after reading these phrases, I subconsciously thought about highly successful (financially) people like Elon Musk and Gates."
      },
      {
        "type": "p",
        "content": "The phrase ‘have in common’ is triggering my curiosity. I want to know the common behaviors or traits that those efficient people have."
      },
      {
        "type": "p",
        "content": "The title also provides me with social proof. It suggests that successful and efficient people use these habits, and I can follow them to achieve the same level of productivity."
      },
      {
        "type": "p",
        "content": "The number ‘18’ adds specificity. It tells me how lengthy the list is and what to expect."
      },
      {
        "type": "p",
        "content": "An effective title can be templated into [What] +  [why/how/for whom it matters]. In other words, a good title is the combination of the two elements: What + why/how/whom."
      },
      {
        "type": "p",
        "content": "And the title under discussion is a good example of this framework."
      },
      {
        "type": "p",
        "content": "What = 18 productivity habits of highly productive people"
      },
      {
        "type": "p",
        "content": "Why (it matters) = because efficient people have them all (in common)."
      },
      {
        "type": "h4",
        "content": "Intro Section"
      },
      {
        "type": "p",
        "content": "The whole introduction is relatable. Although it does not present anything new, it validates what we usually feel/think when thinking about productivity."
      },
      {
        "type": "p",
        "content": "That one picture-perfect person (even if we don’t have one in our circle) comes to mind. And we nod along. We all have a desire to be just like that one super-productive, robotic, and machine-like person arises."
      },
      {
        "type": "p",
        "content": "We all want to finish our hour-long work in 20 minutes and get things done early."
      },
      {
        "type": "p",
        "content": "It’s a shared experience, and we get curious and excited to learn the secret. We get a green light that, yes, this is the blog post that will make me productive like that one ideal person."
      },
      {
        "type": "p",
        "content": "How can you apply this to ANY blog’s intro section?"
      },
      {
        "type": "p",
        "content": "The introduction is a fine mixture of clarity and creativity."
      },
      {
        "type": "p",
        "content": "It fulfills the (twofold) purpose;"
      },
      {
        "type": "p",
        "content": "Unlike other intros, it does not directly mention what we are going to read in the blog post. Instead, it indirectly addresses this by asking two questions."
      },
      {
        "type": "h4",
        "content": "Subheadings and Overall Content Audit"
      },
      {
        "type": "p",
        "content": "This blog is lengthy (6K+ words) with 20 subheadings (18 for tips). It’s a listicle, and the key content is the 18 tips. I will not audit each subheading, but let’s discuss the first subheading, ' Focus on the most important tasks (MITs) first.’"
      },
      {
        "type": "p",
        "content": "Although the idea is generic and sounds obvious. But the angle they used to present it is unique, especially the acronym MITs."
      },
      {
        "type": "p",
        "content": "The first sentence is the play on words. Massachusetts Institute of Technology is a well-known scientific and technological training and research institution. Many of the readers of this blog post would never have been to MIT, but alluding to the institution and then claiming that an MIT (most important task) can help you be more productive is where you feel compelled to read the rest of the content of this heading."
      },
      {
        "type": "p",
        "content": "The second paragraph expands the idea further, explaining the theory behind MIT. Reading this, you can easily differentiate an inefficient, less important, and most important task."
      },
      {
        "type": "p",
        "content": "The third paragraph makes the overall heading more effective and tells the reader how ignoring MIT can lead to procrastination. It tells the consequences of not having an MIT list."
      },
      {
        "type": "p",
        "content": "The fourth paragraph is an ‘actionable’ tip to implement the MITs technique."
      },
      {
        "type": "p",
        "content": "The fifth paragraph is about the aftereffects of implementing that technique."
      },
      {
        "type": "p",
        "content": "But the writer knows the reader still needs confirmation, so they brought productivity coach and expert ‘Laura Earnest’ to share her thoughts on prioritizing MIT."
      },
      {
        "type": "p",
        "content": "So here is the framework that the writer used in this heading (that you can use to write a similar subheading for any given topic) ;"
      },
      {
        "type": "p",
        "content": "[An attention-grabbing first sentence–done by alluding to something famous] + [Explanation of the idea given in the heading] + [Consequences of ignoring the idea (i.e not creating MIT list)] + [Actionable tip] + [Aftereffects of implementing the technique] +  [credible source (expert quote here, but you can use stats, research report or any relevant proven data)]."
      },
      {
        "type": "p",
        "content": "Most importantly, the content of this subheading is logical and conceptually coherent. The writer grabbed your attention, explained the idea, described the benefit, presented an actionable tip, mentioned the aftereffects, and then backed it up with an expert quote."
      },
      {
        "type": "p",
        "content": "This is what I call the “internal coherence’ of the content."
      },
      {
        "type": "p",
        "content": "There is another element in the content of a highly effective blog post, and I call it  ‘overall coherence’. I’ll tell you exactly how the writer implemented it in this blog post."
      },
      {
        "type": "p",
        "content": "As the 18 subheadings are the key content of this blog post…why did the writer decide to make this subheading the very first one?"
      },
      {
        "type": "p",
        "content": "Because before anything else, you need to determine where you need to be productive…"
      },
      {
        "type": "p",
        "content": "It’s more than just making a to-do list. It is about pruning it and knowing what tasks need your attention first."
      },
      {
        "type": "p",
        "content": "In this sense, the remaining 17 tips are built on that one. For instance, the second subheading is ‘cultivate deep work’, which is only possible when you know your most important task. The third subheading is ‘keep a distraction list to stay focused’. Working deeply is only possible when you are conscious of distractions. I can go on and on, but you get the idea."
      },
      {
        "type": "p",
        "content": "Now imagine randomly writing the 18 tips. Place the third one in first place and the fourth one in second place…and you will notice that eventually, even though the content is the same, it’s not effective. It will feel disjointed."
      },
      {
        "type": "p",
        "content": "So, your responsibility as a writer is to help your reader move from point A to point B and then to point C. This applies to non-listicles as well."
      },
      {
        "type": "p",
        "content": "Next time you write a listicle, never write it randomly. Make sure each point/subheading correlates with its predecessor and successor."
      },
      {
        "type": "p",
        "content": "You will notice similar patterns in all 18 tips. Each subheading offers unique insights, novel perspectives, expert quotes, and effective arguments."
      },
      {
        "type": "p",
        "content": "Remember, whenever you’re writing a blog post in a non-technical niche or in a niche with a general audience or topics relevant to any human being, there will already be loads of content published."
      },
      {
        "type": "p",
        "content": "Almost all of the information would already be covered. So, you need to bring novelty or present the same idea with a different twist. Just like this blog post under discussion — we already have so much content on the topic, but when you read this blog post, you will notice that 80-85% of the content is “something new” to you."
      },
      {
        "type": "p",
        "content": "Your responsibility as a writer is to do better than what’s already out there. That’s where your research skills come into play. That's when you need to lean on your creative instincts."
      },
      {
        "type": "h4",
        "content": "Conclusion section"
      },
      {
        "type": "p",
        "content": "As the blog post is 6000+ words…the writer needed to recap the whole thing."
      },
      {
        "type": "p",
        "content": "But just before the recap, the writer used two pointers to make this conclusion section effective."
      },
      {
        "type": "p",
        "content": "In other words, the first paragraph/section synthesizes the whole blog post by classifying the 18 tips into 4 categories."
      },
      {
        "type": "p",
        "content": "The second section/paragraph offers something ‘extra,’ like a further expansion of the blog post. It can stand alone as a separate tip…but writing it in the conclusion section makes it more effective and connects all 18 tips—like when nothing from those 18 tips is working, one should ask for help."
      },
      {
        "type": "h3",
        "content": "Blog Post 3: 10 ways to boost your productivity at work"
      },
      {
        "type": "h4",
        "content": "Title"
      },
      {
        "type": "p",
        "content": "Let’s break down the title."
      },
      {
        "type": "p",
        "content": "‘10 ways’"
      },
      {
        "type": "p",
        "content": "Numbers in a blog post title usually refer to a listicle format. The common perception is that readers are naturally attracted to listicles because they know exactly what they’re getting—clear, digestible, and actionable information. This is a classic approach that works well for drawing clicks, especially in blog articles."
      },
      {
        "type": "p",
        "content": "‘boost your productivity’"
      },
      {
        "type": "p",
        "content": "This phrase offers a direct benefit and taps into a problem-solution framework. It suggests readers may not be performing optimally at work and offers solutions for improvement. It uses implied WIIFM (What's In It For Me?), a basic copywriting principle where the benefit is clear to the reader."
      },
      {
        "type": "p",
        "content": "‘at work’"
      },
      {
        "type": "p",
        "content": "The phrase \"at work\" makes the title audience-specific. The readers could be professionals or employees looking to improve their work habits. It appeals directly to a broad but relevant group of readers."
      },
      {
        "type": "p",
        "content": "But this title is mediocre."
      },
      {
        "type": "p",
        "content": "It’s not bad, but it lacks the punch that would make it exceptionally compelling or click-worthy. Let's dissect why:"
      },
      {
        "type": "p",
        "content": "It’s overused and generic:The combination of \"ways to boost productivity\" is ubiquitous. It’s a generic phrase that gets diluted in a sea of similar titles across the internet. People have likely seen \"boost productivity\" countless times, which can reduce its click appeal. You need something fresh or unique in competitive niches like self-improvement or productivity."
      },
      {
        "type": "p",
        "content": "It misses emotional appeal:The title lacks emotional engagement. Effective titles often trigger emotions—whether excitement, urgency, or curiosity. The title doesn't spark curiosity or a desire for immediate action. It doesn’t feel urgent or compelling enough for the reader to think, “I need to read this now.”"
      },
      {
        "type": "p",
        "content": "It has no unique value proposition (UVP):There’s nothing that differentiates this article from others on productivity. What makes these \"10 ways\" special or different from any other blog on the same topic? Highlighting an unusual method, secret hack, or expert-backed advice could give it an edge."
      },
      {
        "type": "p",
        "content": "Here’s how I’d have written this title;"
      },
      {
        "type": "h4",
        "content": "Introduction Section"
      },
      {
        "type": "p",
        "content": "Let’s dissect the whole introduction section."
      },
      {
        "type": "p",
        "content": "1. Opening Line:"
      },
      {
        "type": "p",
        "content": "“Use these powerful strategies to get more done (while stressing less).”"
      },
      {
        "type": "p",
        "content": "This is a headline-like teaser that introduces the entire listicle and creates intrigue."
      },
      {
        "type": "p",
        "content": "The opening sentence (which we called a ‘strong opener’ in the previous intro section analysis) is the MOST important first sentence."
      },
      {
        "type": "p",
        "content": "The opening sentence of this intro section promises a clear benefit—getting more done while stressing less—which is an appealing hook for the target audience."
      },
      {
        "type": "p",
        "content": "Workplaces are usually stressful places. So, the phrase “stressing less” evokes a sense of control and ease and directly triggers the readers' dealing with workplace stress."
      },
      {
        "type": "p",
        "content": "The opening is concise and straight, giving readers an immediate reason to continue."
      },
      {
        "type": "p",
        "content": "But it has a weakness. It sounds more like a subheading than part of a cohesive narrative. It is somewhat disconnected from the next paragraph and lacks a smooth transition."
      },
      {
        "type": "p",
        "content": "2. First Paragraph:"
      },
      {
        "type": "p",
        "content": "“You reach the end of your workday and glance down at your (now coffee-stained) to-do list. You’re immediately overcome with frustration as you realize that barely half the tasks are checked off.”"
      },
      {
        "type": "p",
        "content": "This paragraph uses the \"relatable story\" approach. It creates a scene in which the reader is directly involved through a second-person narrative (\"you\")."
      },
      {
        "type": "p",
        "content": "The frustration of not checking off tasks on a to-do list is highly relatable. It taps into a common problem experienced by workers everywhere, and the casual mention of the “coffee-stained” to-do list adds an extra layer of realism and daily-life imagery."
      },
      {
        "type": "p",
        "content": "This technique builds empathy with the reader by reflecting on a common pain point."
      },
      {
        "type": "p",
        "content": "The sensory detail (“coffee-stained”) makes the experience more tangible and relatable."
      },
      {
        "type": "p",
        "content": "The only shortcoming I can think of in this paragraph is that sentence structure is slightly long-winded. Breaking it into two shorter sentences would make it snappier."
      },
      {
        "type": "p",
        "content": "3. Second Paragraph:"
      },
      {
        "type": "p",
        "content": "“Seriously, what happened? You’ve been at your desk for the better part of eight hours. Why didn’t you get more accomplished?”"
      },
      {
        "type": "p",
        "content": "This paragraph uses a casual, almost colloquial tone, which improves the narrative's relatability. The rhetorical questions invite readers to reflect on their productivity struggles."
      },
      {
        "type": "p",
        "content": "Asking questions actively engages the reader and makes them think about their situation and why it may have gone wrong."
      },
      {
        "type": "p",
        "content": "It further engages the reader by directly addressing their internal dialogue (“Why didn’t I get more done?”)."
      },
      {
        "type": "p",
        "content": "The informal tone makes the piece conversational and approachable — which connects readers."
      },
      {
        "type": "p",
        "content": "I loved this paragraph. So no apparent weakness here."
      },
      {
        "type": "p",
        "content": "4. Third Paragraph:"
      },
      {
        "type": "p",
        "content": "“Maintaining a high level of productivity is not intuitive or easy – but you don’t have to resign yourself to feeling discouraged and depleted at the end of every workday.”"
      },
      {
        "type": "p",
        "content": "This paragraph shifts from the emotional frustration of being unproductive to a more rational and solution-oriented perspective. It reassures the reader that although productivity is tough, change is possible."
      },
      {
        "type": "p",
        "content": "The writer is using a classic copywriting technique here called         “problem-acknowledgement.” Acknowledging that productivity is “not intuitive or easy” builds trust. Readers feel understood when their struggles are validated."
      },
      {
        "type": "p",
        "content": "The writer then used the “positive-reframe” technique, where you give your reader a green light after acknowledging the problem. The phrase “you don’t have to resign yourself” offers hope, subtly implying that the following content will provide solutions."
      },
      {
        "type": "p",
        "content": "Notice how smoothly the paragraph transitioned from problem identification (frustration) to hope (solutions exist)."
      },
      {
        "type": "p",
        "content": "The tone is very suitable here. It is encouraging and makes readers feel empowered."
      },
      {
        "type": "p",
        "content": "5. Fourth Paragraph (CTA):"
      },
      {
        "type": "p",
        "content": "“We rounded up ten top-notch, rock-solid tips you can put into play to channel your focus and defeat your to-do list – plus a quiz to help get you started.”"
      },
      {
        "type": "p",
        "content": "This sentence signals that actionable solutions are about to be delivered. It is the call to read the whole blog post."
      },
      {
        "type": "p",
        "content": "But the CTA includes an additional offer: a quiz. This provides added value."
      },
      {
        "type": "p",
        "content": "The only thing I did not like that much was the use of buzzwords like “top-notch” and “rock-solid.” It feels overhyped to me."
      },
      {
        "type": "p",
        "content": "Now the most important part of this breakdown; how can you use this intro section format/framework to write any blog post’s introduction?"
      },
      {
        "type": "p",
        "content": "Let me template this for you."
      },
      {
        "type": "p",
        "content": "[Attention-Grabbing Teaser] + [Relatable Pain Point] + [Rhetorical Reflection] + [Problem Acknowledgment] + [CTA for the Main Content]."
      },
      {
        "type": "p",
        "content": "Start with a brief sentence or headline-like teaser that hints at the solution or benefit (e.g., “Use these [adjective] strategies to [solve a problem or achieve benefit].”)."
      },
      {
        "type": "p",
        "content": "Relatable Pain Point (First paragraph):"
      },
      {
        "type": "p",
        "content": "Open with a scene or a specific situation that readers can easily identify with. Use sensory details and second-person narrative to make it personal."
      },
      {
        "type": "p",
        "content": "Rhetorical Reflection (Second paragraph):"
      },
      {
        "type": "p",
        "content": "Ask rhetorical questions to make the reader pause and reflect on their experiences. Keep the tone conversational."
      },
      {
        "type": "p",
        "content": "Problem Acknowledgment (Third paragraph):"
      },
      {
        "type": "p",
        "content": "Acknowledge the problem's difficulty while offering a subtle hint that solutions are coming."
      },
      {
        "type": "p",
        "content": "CTA to read the blog post (Fourth paragraph):"
      },
      {
        "type": "p",
        "content": "Briefly introduce the upcoming tips or advice, and give your readers a reason to read the whole blog post."
      },
      {
        "type": "h4",
        "content": "Overall Key Content Audit (and what you can learn and use for any blog post)"
      },
      {
        "type": "p",
        "content": "We analyzed how to write effective headings in the previous blog post audit. In this audit, let’s discuss the overall blog post."
      },
      {
        "type": "p",
        "content": "First of all, note that the blog post is published by ATLASSIAN. It is a team management software, so it’s basically in the SaaS niche. The target audience is project managers, IT and Operation teams, Marketing teams, small and large enterprises, etc."
      },
      {
        "type": "p",
        "content": "The good stuff;"
      },
      {
        "type": "p",
        "content": "The post is filled with highly actionable and practical advice."
      },
      {
        "type": "p",
        "content": "Each point provides readers with clear, simple steps they can take to improve their productivity. For example, \"Manage your energy, not just your time\" advises keeping a journal to find your productivity peaks. Journaling is a habit of many successful professionals in the SaaS field. So, by reading this, the reader knows exactly how to manage their time best. And it is easy to implement and a tangible solution."
      },
      {
        "type": "p",
        "content": "Each of the 10 points are well-organized."
      },
      {
        "type": "p",
        "content": "The subheadings are descriptive and clear. For instance, “Build a better to-do list”; just by reading it, you’ll know what’s coming. Such subheadings make it easier to skim and immediately understand what each section covers, which is especially effective for professionals with limited reading time."
      },
      {
        "type": "p",
        "content": "The blog effectively incorporates expert insights."
      },
      {
        "type": "p",
        "content": "The post includes quotes from experts like Dr. Melissa Gratias (workplace productivity coach), which add credibility and authority. Professionals believe in credible sources. You can’t just give your opinion out of thin air. So, whenever writing a blog post for such an audience, always back up your claims with some source of expert quotes, stats, or facts."
      },
      {
        "type": "p",
        "content": "The tone is conversational yet professional (what I call professionally engaging)."
      },
      {
        "type": "p",
        "content": "It strikes a balance that engages SaaS users like project managers and teams. The blog speaks directly to the reader’s pain points in a relatable way (“You’re human—you won’t operate at peak efficiency all day, every day”), which keeps the audience invested."
      },
      {
        "type": "p",
        "content": "The post"
      },
      {
        "type": "p",
        "content": "Bullet points within headings make the content digestible and more accessible. This is particularly useful for skimmers and scanners who are in a hurry and may want to quickly find the sections most relevant to them."
      },
      {
        "type": "p",
        "content": "The blog has a data-driven approach."
      },
      {
        "type": "p",
        "content": "Points like \"You use different parts of your brain for different tasks\" and \"Research shows that the human brain is actually incapable of multitasking\" add scientific backing, appealing to the logical, detail-oriented mindset of project managers and IT professionals."
      },
      {
        "type": "p",
        "content": "The post has a variety of productivity methods."
      },
      {
        "type": "p",
        "content": "The post caters to a diverse audience by offering different approaches, such as task batching, time blocking, and the Pomodoro technique. Everyone can find a method that resonates with their work style — an intelligent tactic for broadening the appeal."
      },
      {
        "type": "p",
        "content": "Somehow baddie stuff;"
      },
      {
        "type": "p",
        "content": "There are some complex ideas that need to be simplified."
      },
      {
        "type": "p",
        "content": "The first point introduces \"ultradian rhythms\" and biological cycles, which might be too technical for some readers in this field. While it adds credibility, the explanation could be simplified. Instead of mentioning complex terms, the writer could focus on how energy fluctuates naturally during the day and how readers can use that to their advantage."
      },
      {
        "type": "p",
        "content": "The lesson for you?"
      },
      {
        "type": "p",
        "content": "Avoid jargon or medical terms unless absolutely necessary, and explain things in plain, relatable (to your TA) language."
      },
      {
        "type": "p",
        "content": "There is a bit of repetition in concepts."
      },
      {
        "type": "p",
        "content": "Some of the tips feel repetitive. For example, the advice on \"task switching\" in Point 4 and \"batching tasks\" in Point 5 is quite similar. Both stress focusing on one thing at a time but in slightly different ways. A more concise and focused explanation of these overlapping concepts would help keep the post tighter and avoid redundancy."
      },
      {
        "type": "p",
        "content": "Lesson?"
      },
      {
        "type": "p",
        "content": "Never repeat a concept twice in a blog post."
      },
      {
        "type": "p",
        "content": "There is a bit of inconsistency in the depth of some points."
      },
      {
        "type": "p",
        "content": "Some points, like \"Refine your workspace\" and \"Change your scenery,\" lack depth. These tips are somewhat generic, especially when compared to more nuanced points like \"Let go of perfectionism.\" The readers are now expecting the same in-depth exploration of how workspace setups specifically impact productivity in SaaS environments."
      },
      {
        "type": "p",
        "content": "Lesson?"
      },
      {
        "type": "p",
        "content": "There must be a consistency of research depth throughout the blog post. Keep"
      },
      {
        "type": "h4",
        "content": "Conclusion Section"
      },
      {
        "type": "p",
        "content": "The heading is non-generic and action-oriented."
      },
      {
        "type": "p",
        "content": "“Take control of your productivity at work\" avoids the typical generic conclusion labels like \"Conclusion\" or \"Final Thoughts.” This approach engages the reader rather than signaling the end of the conversation. The content feels open-ended and action-oriented."
      },
      {
        "type": "p",
        "content": "First Paragraph"
      },
      {
        "type": "p",
        "content": "The first paragraph acknowledges a relatable problem: “Most of us have a lot to do... it’s hard to muster the motivation and make the most of your time at work.” This is effective as it reintroduces the challenge the reader is likely facing. The writer has maintained an emotional connection through this para and also reinforced the relevance of the article's content."
      },
      {
        "type": "p",
        "content": "Second Paragraph"
      },
      {
        "type": "p",
        "content": "The second paragraph broadens the topic by reminding readers that productivity isn’t constant: “The truth is that you’re human – you won’t operate at peak efficiency all day, every day.” This sentiment makes the conclusion more realistic and empathetic rather than placing unrealistic expectations on the reader."
      },
      {
        "type": "p",
        "content": "The follow-up with “plenty of things you can try to boost your productivity” gives a gentle call to action, highlighting that while perfection isn't expected, improvement is possible. This keeps the reader thinking about the content and encourages them to act without feeling pressured."
      },
      {
        "type": "p",
        "content": "The tone in the conclusion is consistent with the rest of the post—professionally engaging yet relatable. The flow is smooth, transitioning from problem acknowledgment to action and motivation without abruptly summarizing the post. This helps readers reflect on the content without losing momentum."
      },
      {
        "type": "p",
        "content": "This is a well-executed approach to closing the post without being too final, leaving the reader to consider the next steps."
      },
      {
        "type": "h2",
        "content": "How NOT to Write a Blog Post"
      },
      {
        "type": "h3",
        "content": "Blog Post Example: How to be more productive: 10 productivity tips"
      },
      {
        "type": "p",
        "content": "This blog post is ranking at the first position (at the time I am doing all of this) and is even beating ActiveCampaign and Atlassian, but this is an instance of how I would never write a blog post. And I’ll tell you exactly why in the following pointers."
      },
      {
        "type": "p",
        "content": "The introduction section is weak and not compelling."
      },
      {
        "type": "p",
        "content": "It lacks a strong hook and doesn’t clearly outline the value the reader will gain. It begins with a general and obvious question: “Struggling to feel productive?”  It’s not a strong opening, as obviously the reader wants to be more productive and they are struggling with it, that’s the only reason they on this blog post."
      },
      {
        "type": "p",
        "content": "If you call it the “identification of a problem,” I’d say it's really weak and bland."
      },
      {
        "type": "p",
        "content": "The third sentence is again a question, just like the first sentence. It sounds repetitive. And never ask more than one question (even if it’s a rhetorical) in your introduction section...otherwise you will lose the effectiveness of your narrative. Never ask a direct question because teh answer in that case will be subjective. And you don’t know the exact answer. The psychology behind asking a rhetorical question is that your entire blog post is then the answer to that rhetorical question."
      },
      {
        "type": "p",
        "content": "There are unnecessary subheadings that clearly deviate from search intent."
      },
      {
        "type": "p",
        "content": "The blog post includes several subheadings that deviate from the primary focus of teaching readers how to be more productive."
      },
      {
        "type": "p",
        "content": "For example:"
      },
      {
        "type": "p",
        "content": "\"What is productivity?\" shifts from practical productivity tips to defining a term that most readers already understand. People who search for “how to be more productive” are usually looking for actionable steps, not theoretical explanations. So this heading is disrupting the flow of the blog post and doesn’t align with the search intent."
      },
      {
        "type": "p",
        "content": "\"What is toxic productivity?\" also pulls the reader in a different direction. While this is an interesting topic, it doesn’t serve the reader's goal of learning about productivity techniques. It is not the “key content” as the readers are not concerned about the ‘types of productivity’. This section could be better suited to an entirely different post that focuses on avoiding burnout or toxic productivity, instead of one that promises tips to enhance productivity."
      },
      {
        "type": "p",
        "content": "\"How to be more productive at work\" adds little value since the entire blog post is supposed to be about improving productivity in the first place. It's a redundant subheading that doesn’t contribute to the overall flow and can be omitted. Simply diving into the productivity tips would maintain focus and keep readers engaged."
      },
      {
        "type": "p",
        "content": "So the rule of thumb here is that just after the introduction section, directly jump to the key content."
      },
      {
        "type": "p",
        "content": "The blog post has generic/Vague subheadings."
      },
      {
        "type": "p",
        "content": "Some of the subheadings in the post are too brief or vague, which detracts from their impact and leaves the reader unsure of what value the tips will provide. For example:"
      },
      {
        "type": "p",
        "content": "\"Set small goals\" doesn’t fully capture the importance of breaking down large tasks. It would be more effective to phrase the heading in a way that highlights the benefit, such as “Break Down Large Tasks for Steady Progress.” So that the reader can get a clear idea of what to expect and why the tip matters."
      },
      {
        "type": "p",
        "content": "\"Take a break\" is similarly too generic. This could be improved to something like “Take Strategic Breaks to Increase your Focus.” The idea here is to explain why the advice is useful in the subheading itself."
      },
      {
        "type": "p",
        "content": "\"Delegate\" is another common term that needs more depth. A more descriptive subheading could be something like “Increase Efficiency by Delegating the Right Tasks.” This adds value to the reader by clarifying the benefit and aligning the heading with actionable advice."
      },
      {
        "type": "p",
        "content": "That’s why I always say sub/heading should always be descriptive, clear and meaningful."
      },
      {
        "type": "p",
        "content": "The conclusion is typical and generic."
      },
      {
        "type": "p",
        "content": "The post wraps up with the subheading \"Final thoughts,\" which isn’t particularly engaging or memorable. This kind of conclusion feels more like a summary, which can leave the reader feeling unsatisfied. Instead, the conclusion should synthesize the key points or encourage the reader to take action based on what they’ve learned. Something like “Productivity is Never an Accident” would be more impactful because it encourages the reader to ‘grind’ and make ‘being productive’ a habit while implementing all the tips discussed."
      },
      {
        "type": "h2",
        "content": "Homework For Newbies"
      }
    ]
  },
  "7": {
    "title": "Unit 5: FAQs",
    "sections": [
      {
        "type": "h1",
        "content": "Unit 5: FAQs"
      }
    ]
  },
  "8": {
    "title": "Your Most pressing questions are answered here",
    "sections": [
      {
        "type": "h1",
        "content": "Your Most pressing questions are answered here"
      },
      {
        "type": "h3",
        "content": "How to Write a “good” blog post?"
      },
      {
        "type": "p",
        "content": "My junior writers (in my team) often ask me this question."
      },
      {
        "type": "p",
        "content": "“Saiq, can you tell me the exact formula for writing a ‘good’ blog post?”"
      },
      {
        "type": "p",
        "content": "My answers vary every single time."
      },
      {
        "type": "p",
        "content": "TBH, there is no pet and exact formula to write a good blog post."
      },
      {
        "type": "p",
        "content": "Good is subjective. And good is not measurable (formulas are used for something measurable)."
      },
      {
        "type": "p",
        "content": "For Google, the ‘good’ blog post signal is EEAT."
      },
      {
        "type": "p",
        "content": "Google considers;"
      },
      {
        "type": "p",
        "content": "For how long has a reader stayed on the page?"
      },
      {
        "type": "p",
        "content": "How many social media shares did the blog earn?"
      },
      {
        "type": "p",
        "content": "How many other websites referred to the blog post?"
      },
      {
        "type": "p",
        "content": "A blog ticking at least these three (yes, there are many) is ‘Good’ for Google."
      },
      {
        "type": "p",
        "content": "If we talk about humans…and what they consider as ‘good’, then I can think of things like;"
      },
      {
        "type": "p",
        "content": "Now, every topic is contextual. By context, I mean the nature of the topic and the target audience. Every blog post has a different and ‘unique’ purpose and serves a unique set of audiences."
      },
      {
        "type": "p",
        "content": "I have tried many copywriting formulas on blog posts…some of them are;"
      },
      {
        "type": "p",
        "content": "Now, this is my observation and categorization of applying different formulas on different levels (or what we call the ‘journey of a reader). Of course you can apply PAS to Bofu or AIDA to pass. And as I said…it’s always contextual."
      },
      {
        "type": "p",
        "content": "Here are some more formulas I try often;"
      },
      {
        "type": "p",
        "content": "Your blog should be clear, concise, compelling, and credible."
      },
      {
        "type": "p",
        "content": "(Yes, it’s a formula, too)"
      },
      {
        "type": "p",
        "content": "The goal is to write a meaningful, quality blog that is EEAT-aligned and satisfies search intent. The methodology and writing approach may vary with each blog post, but the end goal is the same, as I mentioned."
      },
      {
        "type": "h3",
        "content": "How much should I charge for a blog post of 1000-1200 words?"
      },
      {
        "type": "p",
        "content": "Money = value"
      },
      {
        "type": "p",
        "content": "Your clients pay you because you are adding some kind of value to their life.Here are some reasons someone hired you to write a blog post;"
      },
      {
        "type": "p",
        "content": "As an SEO writer, you can 100% tick the first two; the latter two depend on many factors…and are not in your full control, but they are possible if you do good work."
      },
      {
        "type": "p",
        "content": "Your client doesn’t hire you just to type some words and fulfill the formality of publishing blog posts."
      },
      {
        "type": "p",
        "content": "So, first of all, evaluate what you can do for your client. How much value can you provide? The more value you provide, the more you deserve to get paid."
      },
      {
        "type": "p",
        "content": "But…that’s not the answer to your question."
      },
      {
        "type": "p",
        "content": "If you just started and have never written for a client, I’d highly suggest that you WORK FOR FREE, especially for an inexperienced (individual) SEO writer. Reach out to them and offer your help. Tell them that you will write for free, but you will need their detailed feedback on your write-up. This is the best way to learn and upskill instead of charging pennies and getting rejected every time. I do that for my junior writers…it’s been a year now, and I have 1 such student at a time. I ‘graduated’ three till now."
      },
      {
        "type": "p",
        "content": "When I started SEO blog writing after working as an academic writer for over a year, I charged based on my time and effort."
      },
      {
        "type": "p",
        "content": "My first-ever client paid me $25 for a 2000-word blog (and she was from the US). I spent 7-8 hours researching and writing. It was about October-December in 2021, and the dollar was under 200 PKR(170-175). So, I got paid 4,250 PKR for 2000 words, or 2.1 PKR per word, and that too from an international client."
      },
      {
        "type": "p",
        "content": "Then, with time, when my writing skills improved a bit….my clients used to pay me $30-35  for a blog (no matter the word count) from early 2023 to around August 2023."
      },
      {
        "type": "p",
        "content": "During that period (Jan 2023-Aug 2023), I focused on upskilling and learning on-page SEO and other necessary stuff to polish my SEO blogs. In the last quarter of 2023 (Aug - Dec), I was in a position where I could negotiate the prices…I’d close a deal between 35-50 bucks for an 800-1200 word blog post. Now (June 2024), I charge way more than 50 bucks per post."
      },
      {
        "type": "p",
        "content": "You get the idea of what I’m talking about, right?"
      },
      {
        "type": "p",
        "content": "So now let’s talk about you."
      },
      {
        "type": "p",
        "content": "Look at yourself. Where do you stand?"
      },
      {
        "type": "p",
        "content": "If you are totally new…with little to ZERO experience working with a client. But if you know the basics of on-page SEO and how to research and write content that actually makes sense and is helpful for the readers then you are FREE to charge whatever you want to charge."
      },
      {
        "type": "p",
        "content": "Again let me REPEAT…"
      },
      {
        "type": "p",
        "content": "Only if you know how to RESEARCH and write content that actually MAKES SENSE and is HELPFUL for the readers."
      },
      {
        "type": "p",
        "content": "Let’s talk about some numbers (and this my own evaluation, you’re free to agree or disagree)."
      },
      {
        "type": "p",
        "content": "If you are a newbie (you’ve written less than 10 blogs for clients), a justified rate would be 15-20 bucks (or 3k-5k PKR) for an 800-1000-word blog post…and $25-30 for a 1500-2000-word blog post. If you have done your practice and know the research process, you will need 6-7 hours of focused work for a 1000-1200-word write-up."
      },
      {
        "type": "p",
        "content": "If you are a mid-level blog writer (you’ve written more than 50 blog posts for clients), and you have some testimonials and a track record, then you are in a position to negotiate the prices a bit."
      },
      {
        "type": "p",
        "content": "That’s a phase where the ‘show, don’t tell’ formula applies. Ask about your client’s budget. Tell them how much you charged for something similar to your previous client. You can close the deal between 30-50 (6k-8k PKR) bucks for a 1000-1500 word blog post."
      },
      {
        "type": "p",
        "content": "Now….here are some other important factors you should keep in mind…"
      },
      {
        "type": "p",
        "content": "Working with local or international clients?"
      },
      {
        "type": "p",
        "content": "Or shall I rephrase this into “working with developing countries or developed countries clients”?"
      },
      {
        "type": "p",
        "content": "Developing countries’ clients usually have low budgets. They need more work done in the least possible budget. But again, remember that’s not the case with every client. So, before making any judgments, evaluate the position of your client. You will literally be able to guess it in the first 10-15 messages (or in the first 1-3 minutes of e-meeting them)."
      },
      {
        "type": "p",
        "content": "I never worked with any local (Pakistani) client. But my fellow writers often tell me that you learn and practice more when working with local clients. I think this is because you don’t have a communication gap with them; they tell you clearly what they want, and you convey exactly what you think and can do."
      },
      {
        "type": "p",
        "content": "Local clients pay in local currencies…so always quote them in local currency."
      },
      {
        "type": "p",
        "content": "Once, I was looking for a writer and reached out to one…and the girl quoted me in dollars (that too, what she used to quote to her UK/US clients)."
      },
      {
        "type": "p",
        "content": "Never forget the context in which you are dealing."
      },
      {
        "type": "p",
        "content": "Working directly or any job platform?"
      },
      {
        "type": "p",
        "content": "If you are working on Fiverr, Upwork (or any other job platform), the pricing thing is already almost sorted. Especially on Fiverr, you don’t have to discuss it much with the clients as your pricing is mentioned on your gigs. So, before creating your gigs, do market research and analyze what other freelancers in the same niche/category/gigs are charging and what they provide at that price."
      },
      {
        "type": "p",
        "content": "Similarly, on Upwork, the client’s budget is usually mentioned in the job description. Your hourly rate is set on your profile, and the prices are also in your project catalog."
      },
      {
        "type": "p",
        "content": "All you have to do is research the market."
      },
      {
        "type": "p",
        "content": "But if you are working with a client you landed through social media (LinkedIn, FB, Instagram, or direct outreach), you will have to discuss the price, and that’s where writers get confused."
      },
      {
        "type": "p",
        "content": "You can utilize your job platform market price research knowledge here or evaluate the pricing, looking at the required time, effort, and skill level."
      },
      {
        "type": "p",
        "content": "Working with a company/organization or an individual client?"
      },
      {
        "type": "p",
        "content": "If you work with a company or organization, the prices will depend on what they normally pay their writers. Digital marketing companies or companies that provide services need more writers, so they already have a set budget. In most cases, they offer monthly packages. So, before working with them, consider your responsibilities as a writer and what they pay."
      },
      {
        "type": "p",
        "content": "On the other hand, individual clients mostly pay per project or per word basis. Some have low budgets, and some are high-tickets. You have to analyze their situation and quote accordingly. If you still didn’t get your answer, then know that there is no exact answer to this question."
      },
      {
        "type": "h3",
        "content": "How do I know my writing is good?"
      },
      {
        "type": "p",
        "content": "I’ll give you some practical advice in a while, but first, let me clarify something."
      },
      {
        "type": "p",
        "content": "There is no benchmark of ‘good’ writing. This means you can’t decide whether your writing is good or bad. There are no ‘objectively’ good writers and good work. You can’t measure how good a piece of writing is. Good is subjective. Sometimes, what seems good to me looks terrible to others, and vice versa."
      },
      {
        "type": "p",
        "content": "Generally, a good write-up is flowy, clear, meaningful, authentic, and original."
      },
      {
        "type": "p",
        "content": "Flowy = There is a coherence in ideas from start to end. Each paragraph continues the bigger idea while simultaneously ‘revealing’ new information. Each heading/subheading is the continuation of the bigger idea while at the same time fulfilling its certain purpose. Your blog post has a proper structure and a formating framework from the start to end."
      },
      {
        "type": "p",
        "content": "Clear = The content clearly conveys what you want to say to your ideal reader. No unnecessary phrases. No difficult vocabulary (words that your reader doesn’t have to look up in a dictionary for meanings). No passive voice (until it’s unavoidable). Less to no use of filler words (basically, actually, just, you know, etc.)"
      },
      {
        "type": "p",
        "content": "Meaningful = When someone grabs a pen and paper and starts jotting gibberish…it would be meaningless. If someone takes the time to understand the ‘what’, ‘why’, and ‘ to whom’ before writing anything…it would be meaningful writing. Meaningful writing is a ‘response’. It’s effective. It has a certain purpose. As a writer, you choose the most suitable word within a specific content and write each sentence carefully. You infuse life into your words."
      },
      {
        "type": "p",
        "content": "Authentic = Your writing is believable in the real-world setting and backed up with credible sources and citations. No exaggeration. No false claims. Practical and delivering on the promise you made in your headline or intro."
      },
      {
        "type": "p",
        "content": "Original = If you copy-pasted others’ opinions, formats, structures, and information, you are not writing something original….you’re simply plagiarizing. Original writing contains something new…something of your own. It might be your opinion, observation, analysis, prediction, or derived idea."
      },
      {
        "type": "p",
        "content": "All good."
      },
      {
        "type": "p",
        "content": "Now…"
      },
      {
        "type": "p",
        "content": "How do you ensure you have all the above pointers in place?"
      },
      {
        "type": "p",
        "content": "By answering these three questions before you write a single word;"
      },
      {
        "type": "p",
        "content": "The more you dig into answering these three questions…the more flowy, clear, meaningful, authentic, and original your writing will be.  That is why good writing is subjective: every writer has a different apprehension of the above three questions."
      },
      {
        "type": "h3",
        "content": "How long should a blog post be?"
      },
      {
        "type": "p",
        "content": "This question sounds very amateur when a writer asks me how many words they should write for a blog post. Or what the word count of the blog post is."
      },
      {
        "type": "p",
        "content": "You don’t need to write just to fulfill the word count limit. If you are doing so, that means you are “typing,” not writing, and you don’t know the “purpose” and “why” you’re writing."
      },
      {
        "type": "p",
        "content": "If you are working with a business owner who has never written a blog post, they can’t tell you how many words are enough to cover a specific topic. So, this question is totally invalid to ask from your client who is unfamiliar with writing. Never ask it."
      },
      {
        "type": "p",
        "content": "The case is different when working with a senior SEO writer or someone who deals with SEO writers (Marketer, editor, or SEO specialist). Again, the right question would be, “What’s the average word count of a blog post of this (the topic given) nature”?"
      },
      {
        "type": "p",
        "content": "But I think this question is irrelevant; you don’t need to ask it anyway."
      },
      {
        "type": "p",
        "content": "The length of a blog post depends on the SI (search intent)."
      },
      {
        "type": "p",
        "content": "After your research and analysis, you will get to know three things;"
      },
      {
        "type": "p",
        "content": "Once you know the answer to these three questions, you’ll automatically know the ideal length of a blog post."
      },
      {
        "type": "p",
        "content": "Your duty as a writer is to take care of two things;"
      },
      {
        "type": "p",
        "content": "This is the one way of writing a high-quality, concise, and no-fluff piece."
      },
      {
        "type": "p",
        "content": "You can also sneak peek into the ranking blogs and get an idea of the average word count."
      },
      {
        "type": "p",
        "content": "Side Note: Usually, the sweet spot for almost any blog post is 800 to 1200 words unless you’re writing a step-by-step tutorial, a guide, or a pillar page."
      },
      {
        "type": "h3",
        "content": "How to Retain Good Clients?"
      },
      {
        "type": "p",
        "content": "Short answer = By providing insane value everytime they assign you a task."
      },
      {
        "type": "p",
        "content": "Long answer…"
      },
      {
        "type": "p",
        "content": "I’ll share a short story."
      },
      {
        "type": "p",
        "content": "In November 2023, a client approached me on Upwork, looking for someone to write a script for his faceless youtube channel."
      },
      {
        "type": "p",
        "content": "He was ideally searching for someone who can do the editing and voiceover too."
      },
      {
        "type": "p",
        "content": "I am a straightforward person…and at that time I did not have my team…so I honestly told him what I can do for him… my rate for the script writing and what he should expect."
      },
      {
        "type": "p",
        "content": "I knew he was chatting with other freelancers but I didn’t make any exaggerated shiny promises."
      },
      {
        "type": "p",
        "content": "As expected, the next day he told me that he hired someone who’ll do all three tasks in the budget that I quoted just for writing."
      },
      {
        "type": "p",
        "content": "I said “I’m happy you found someone better than me in the same budget”. And then I shared some of my best tips for how to get most of the script writing and what should he advise to the freelancer he hired."
      },
      {
        "type": "p",
        "content": "He appreciated my suggestions and asked “what is your primary skill”?"
      },
      {
        "type": "p",
        "content": "I told him that I write SEO blog posts, if any of your friends have a website and need blog posts I’ll be happy to help”."
      },
      {
        "type": "p",
        "content": "That’s when he shared his website. It was on Wix. He knew nothing about content, CRMs or anything. But he wanted “something” where he could directly get leads for personal chef services. He was fed up with third party apps. I empathized with his pain point, and asked him to give me 24 hours to get back with some solution."
      },
      {
        "type": "p",
        "content": "Next day, after discussing everything with my WordPress expert friend, I returned to him and presented him with a full plan on how we can create a site from scratch on WordPress and write a copy for his three core services and start blogs and everything."
      },
      {
        "type": "p",
        "content": "I had the whole plan written in a Google Doc…and to make him understand everything, I asked him to hop on a call. We chatted for almost 2+ hours. He agreed to create a new site. And then he asked the most difficult question “how much will everything cost me”?"
      },
      {
        "type": "p",
        "content": "I had no idea."
      },
      {
        "type": "p",
        "content": "So, I said “give me 24 hours and I’ll send you a detailed proposal”."
      },
      {
        "type": "p",
        "content": "In the proposal, I mentioned everything with minute  details and then I quoted the price."
      },
      {
        "type": "p",
        "content": "But I didn’t ask him to pay me upfront or anything…I told him that we will set up the website and I will write the copy for service pages and if he absolutely loves what we did, only then will he pay."
      },
      {
        "type": "p",
        "content": "He loved it. And since Dec 2023, we have been working together."
      },
      {
        "type": "p",
        "content": "Now here are some of the pointers to retain good clients;"
      },
      {
        "type": "p",
        "content": "(Good clients = those for whom you love working with)."
      }
    ]
  }
}